{
  "species": {
    "<pad>": 0,
    "<unknown>": 1,
    "Alcremie": 2,
    "Alcremie-Mint-Cream": 3,
    "Alcremie-Salted-Cream": 4,
    "Altaria": 5,
    "Amoonguss": 6,
    "Annihilape": 7,
    "Araquanid": 8,
    "Arcanine-Hisui": 9,
    "Archaludon": 10,
    "Armarouge": 11,
    "Articuno-Galar": 12,
    "Basculegion": 13,
    "Bastiodon": 14,
    "Beartic": 15,
    "Braviary-Hisui": 16,
    "Brute Bonnet": 17,
    "Calyrex-Ice": 18,
    "Calyrex-Shadow": 19,
    "Ceruledge": 20,
    "Chandelure": 21,
    "Chesnaught": 22,
    "Chi-Yu": 23,
    "Chien-Pao": 24,
    "Clefairy": 25,
    "Cobalion": 26,
    "Comfey": 27,
    "Conkeldurr": 28,
    "Cresselia": 29,
    "Dialga-Origin": 30,
    "Ditto": 31,
    "Dondozo": 32,
    "Dragapult": 33,
    "Dragonite": 34,
    "Dusclops": 35,
    "Electabuzz": 36,
    "Enamorus-Therian": 37,
    "Entei": 38,
    "Eternatus": 39,
    "Excadrill": 40,
    "Farigiraf": 41,
    "Flamigo": 42,
    "Flutter Mane": 43,
    "Gallade": 44,
    "Gardevoir": 45,
    "Garganacl": 46,
    "Gastrodon": 47,
    "Gholdengo": 48,
    "Giratina-Origin": 49,
    "Glimmora": 50,
    "Golduck": 51,
    "Gothitelle": 52,
    "Gouging Fire": 53,
    "Great Tusk": 54,
    "Grimmsnarl": 55,
    "Groudon": 56,
    "Hatterene": 57,
    "Heatran": 58,
    "Hitmontop": 59,
    "Ho-Oh": 60,
    "Hydrapple": 61,
    "Incineroar": 62,
    "Indeedee": 63,
    "Indeedee-F": 64,
    "Infernape": 65,
    "Iron Boulder": 66,
    "Iron Bundle": 67,
    "Iron Crown": 68,
    "Iron Hands": 69,
    "Iron Jugulis": 70,
    "Iron Leaves": 71,
    "Iron Moth": 72,
    "Iron Treads": 73,
    "Iron Valiant": 74,
    "Jigglypuff": 75,
    "Jumpluff": 76,
    "Kingambit": 77,
    "Klefki": 78,
    "Koraidon": 79,
    "Kyogre": 80,
    "Kyurem-Black": 81,
    "Kyurem-White": 82,
    "Landorus": 83,
    "Landorus-Therian": 84,
    "Latios": 85,
    "Lilligant-Hisui": 86,
    "Ludicolo": 87,
    "Lugia": 88,
    "Lumineon": 89,
    "Lunala": 90,
    "Magikarp": 91,
    "Malamar": 92,
    "Maushold": 93,
    "Maushold-Four": 94,
    "Medicham": 95,
    "Meowstic": 96,
    "Metagross": 97,
    "Mewtwo": 98,
    "Mienshao": 99,
    "Milotic": 100,
    "Mimikyu": 101,
    "Mimikyu-Busted": 102,
    "Miraidon": 103,
    "Moltres-Galar": 104,
    "Mudsdale": 105,
    "Muk-Alola": 106,
    "Munkidori": 107,
    "Murkrow": 108,
    "Necrozma-Dawn-Wings": 109,
    "Necrozma-Dusk-Mane": 110,
    "Ninetales-Alola": 111,
    "Noivern": 112,
    "Ogerpon": 113,
    "Ogerpon-Cornerstone": 114,
    "Ogerpon-Cornerstone-Tera": 115,
    "Ogerpon-Hearthflame": 116,
    "Ogerpon-Hearthflame-Tera": 117,
    "Ogerpon-Teal-Tera": 118,
    "Ogerpon-Wellspring": 119,
    "Ogerpon-Wellspring-Tera": 120,
    "Okidogi": 121,
    "Oranguru": 122,
    "Overqwil": 123,
    "Palafin": 124,
    "Palafin-Hero": 125,
    "Palkia": 126,
    "Palkia-Origin": 127,
    "Pelipper": 128,
    "Persian-Alola": 129,
    "Pikachu": 130,
    "Porygon2": 131,
    "Primarina": 132,
    "Qwilfish-Hisui": 133,
    "Raging Bolt": 134,
    "Raichu": 135,
    "Raichu-Alola": 136,
    "Rayquaza": 137,
    "Regice": 138,
    "Regidrago": 139,
    "Regieleki": 140,
    "Regigigas": 141,
    "Reshiram": 142,
    "Rhydon": 143,
    "Rhyperior": 144,
    "Rillaboom": 145,
    "Roaring Moon": 146,
    "Sableye": 147,
    "Salazzle": 148,
    "Sandy Shocks": 149,
    "Sawsbuck": 150,
    "Sceptile": 151,
    "Scovillain": 152,
    "Scraggy": 153,
    "Scream Tail": 154,
    "Sentret": 155,
    "Shiftry": 156,
    "Sinistcha": 157,
    "Sinistcha-Masterpiece": 158,
    "Skeledirge": 159,
    "Slowking": 160,
    "Slowpoke": 161,
    "Smeargle": 162,
    "Sneasler": 163,
    "Spectrier": 164,
    "Suicune": 165,
    "Sylveon": 166,
    "Talonflame": 167,
    "Tatsugiri": 168,
    "Tatsugiri-Droopy": 169,
    "Terapagos": 170,
    "Terapagos-Stellar": 171,
    "Terapagos-Terastal": 172,
    "Thundurus": 173,
    "Thundurus-Therian": 174,
    "Ting-Lu": 175,
    "Tinkaton": 176,
    "Toedscruel": 177,
    "Torkoal": 178,
    "Tornadus": 179,
    "Torterra": 180,
    "Toxapex": 181,
    "Toxicroak": 182,
    "Tropius": 183,
    "Tsareena": 184,
    "Typhlosion-Hisui": 185,
    "Tyranitar": 186,
    "Ursaluna": 187,
    "Ursaluna-Bloodmoon": 188,
    "Urshifu": 189,
    "Urshifu-*": 190,
    "Urshifu-Rapid-Strike": 191,
    "Venusaur": 192,
    "Vikavolt": 193,
    "Volbeat": 194,
    "Volcarona": 195,
    "Walking Wake": 196,
    "Weavile": 197,
    "Weezing": 198,
    "Weezing-Galar": 199,
    "Whimsicott": 200,
    "Wo-Chien": 201,
    "Zacian-*": 202,
    "Zacian-Crowned": 203,
    "Zamazenta-*": 204,
    "Zamazenta-Crowned": 205,
    "Zapdos-Galar": 206,
    "Zebstrika": 207,
    "Zoroark-Hisui": 208
  },
  "actions": {
    "<pad>": 0,
    "<none>": 1,
    "<cant>": 2,
    "move:Acid Spray": 3,
    "move:Acrobatics": 4,
    "move:Aerial Ace": 5,
    "move:Aeroblast": 6,
    "move:After You": 7,
    "move:Alluring Voice": 8,
    "move:Ally Switch": 9,
    "move:Aqua Jet": 10,
    "move:Armor Cannon": 11,
    "move:Astral Barrage": 12,
    "move:Aura Sphere": 13,
    "move:Aurora Veil": 14,
    "move:Baneful Bunker": 15,
    "move:Barb Barrage": 16,
    "move:Baton Pass": 17,
    "move:Beat Up": 18,
    "move:Behemoth Bash": 19,
    "move:Behemoth Blade": 20,
    "move:Bitter Blade": 21,
    "move:Bleakwind Storm": 22,
    "move:Blood Moon": 23,
    "move:Blue Flare": 24,
    "move:Body Press": 25,
    "move:Brave Bird": 26,
    "move:Breaking Swipe": 27,
    "move:Bulk Up": 28,
    "move:Bulldoze": 29,
    "move:Bullet Seed": 30,
    "move:Calm Mind": 31,
    "move:Clear Smog": 32,
    "move:Close Combat": 33,
    "move:Coaching": 34,
    "move:Collision Course": 35,
    "move:Cosmic Power": 36,
    "move:Crunch": 37,
    "move:Curse": 38,
    "move:Dark Pulse": 39,
    "move:Dazzling Gleam": 40,
    "move:Decorate": 41,
    "move:Detect": 42,
    "move:Dire Claw": 43,
    "move:Disable": 44,
    "move:Discharge": 45,
    "move:Double-Edge": 46,
    "move:Draco Meteor": 47,
    "move:Dragon Ascent": 48,
    "move:Dragon Cheer": 49,
    "move:Dragon Darts": 50,
    "move:Dragon Pulse": 51,
    "move:Drain Punch": 52,
    "move:Draining Kiss": 53,
    "move:Drum Beating": 54,
    "move:Dynamax Cannon": 55,
    "move:Earth Power": 56,
    "move:Earthquake": 57,
    "move:Electro Drift": 58,
    "move:Electro Shot": 59,
    "move:Electroweb": 60,
    "move:Encore": 61,
    "move:Endeavor": 62,
    "move:Energy Ball": 63,
    "move:Eruption": 64,
    "move:Expanding Force": 65,
    "move:Explosion": 66,
    "move:Extreme Speed": 67,
    "move:Facade": 68,
    "move:Fake Out": 69,
    "move:Fake Tears": 70,
    "move:Feint": 71,
    "move:Fiery Dance": 72,
    "move:Fiery Wrath": 73,
    "move:Final Gambit": 74,
    "move:Fire Blast": 75,
    "move:Fire Punch": 76,
    "move:Fire Spin": 77,
    "move:Fissure": 78,
    "move:Flame Charge": 79,
    "move:Flamethrower": 80,
    "move:Flare Blitz": 81,
    "move:Flash Cannon": 82,
    "move:Focus Energy": 83,
    "move:Follow Me": 84,
    "move:Foul Play": 85,
    "move:Freeze-Dry": 86,
    "move:Fusion Bolt": 87,
    "move:Fusion Flare": 88,
    "move:Giga Drain": 89,
    "move:Giga Impact": 90,
    "move:Glacial Lance": 91,
    "move:Grass Knot": 92,
    "move:Grass Pledge": 93,
    "move:Grassy Glide": 94,
    "move:Gravity": 95,
    "move:Gunk Shot": 96,
    "move:Haze": 97,
    "move:Headlong Rush": 98,
    "move:Heal Pulse": 99,
    "move:Healing Wish": 100,
    "move:Heat Crash": 101,
    "move:Heat Wave": 102,
    "move:Heavy Slam": 103,
    "move:Helping Hand": 104,
    "move:Hex": 105,
    "move:High Horsepower": 106,
    "move:Horn Leech": 107,
    "move:Howl": 108,
    "move:Hurricane": 109,
    "move:Hydro Pump": 110,
    "move:Hydro Steam": 111,
    "move:Hyper Beam": 112,
    "move:Hyper Voice": 113,
    "move:Ice Beam": 114,
    "move:Ice Punch": 115,
    "move:Ice Shard": 116,
    "move:Ice Spinner": 117,
    "move:Icicle Crash": 118,
    "move:Icicle Spear": 119,
    "move:Icy Wind": 120,
    "move:Imprison": 121,
    "move:Infestation": 122,
    "move:Instruct": 123,
    "move:Iron Defense": 124,
    "move:Iron Head": 125,
    "move:Ivy Cudgel": 126,
    "move:Jet Punch": 127,
    "move:Knock Off": 128,
    "move:Kowtow Cleave": 129,
    "move:Lash Out": 130,
    "move:Last Respects": 131,
    "move:Leaf Blade": 132,
    "move:Leaf Storm": 133,
    "move:Leech Life": 134,
    "move:Leech Seed": 135,
    "move:Leer": 136,
    "move:Life Dew": 137,
    "move:Light Screen": 138,
    "move:Liquidation": 139,
    "move:Low Kick": 140,
    "move:Lunar Blessing": 141,
    "move:Luster Purge": 142,
    "move:Magma Storm": 143,
    "move:Make It Rain": 144,
    "move:Matcha Gotcha": 145,
    "move:Memento": 146,
    "move:Meteor Beam": 147,
    "move:Minimize": 148,
    "move:Misty Explosion": 149,
    "move:Misty Terrain": 150,
    "move:Moonblast": 151,
    "move:Moongeist Beam": 152,
    "move:Morning Sun": 153,
    "move:Mortal Spin": 154,
    "move:Muddy Water": 155,
    "move:Mystical Fire": 156,
    "move:Nasty Plot": 157,
    "move:Night Slash": 158,
    "move:Nuzzle": 159,
    "move:Order Up": 160,
    "move:Origin Pulse": 161,
    "move:Outrage": 162,
    "move:Overheat": 163,
    "move:Parabolic Charge": 164,
    "move:Parting Shot": 165,
    "move:Perish Song": 166,
    "move:Photon Geyser": 167,
    "move:Play Rough": 168,
    "move:Poison Gas": 169,
    "move:Poison Jab": 170,
    "move:Pollen Puff": 171,
    "move:Poltergeist": 172,
    "move:Population Bomb": 173,
    "move:Power Gem": 174,
    "move:Power Split": 175,
    "move:Power Whip": 176,
    "move:Precipice Blades": 177,
    "move:Protect": 178,
    "move:Psyblade": 179,
    "move:Psych Up": 180,
    "move:Psychic": 181,
    "move:Psychic Noise": 182,
    "move:Psyshock": 183,
    "move:Psystrike": 184,
    "move:Quash": 185,
    "move:Quick Attack": 186,
    "move:Quick Guard": 187,
    "move:Quiver Dance": 188,
    "move:Rage Fist": 189,
    "move:Rage Powder": 190,
    "move:Rain Dance": 191,
    "move:Recover": 192,
    "move:Reflect": 193,
    "move:Rising Voltage": 194,
    "move:Roar": 195,
    "move:Rock Slide": 196,
    "move:Rock Tomb": 197,
    "move:Ruination": 198,
    "move:Sacred Fire": 199,
    "move:Sacred Sword": 200,
    "move:Salt Cure": 201,
    "move:Sand Tomb": 202,
    "move:Sandsear Storm": 203,
    "move:Scald": 204,
    "move:Scale Shot": 205,
    "move:Scary Face": 206,
    "move:Seed Bomb": 207,
    "move:Shadow Ball": 208,
    "move:Shadow Claw": 209,
    "move:Shadow Force": 210,
    "move:Shadow Sneak": 211,
    "move:Shed Tail": 212,
    "move:Sing": 213,
    "move:Skill Swap": 214,
    "move:Slack Off": 215,
    "move:Sleep Powder": 216,
    "move:Sludge Bomb": 217,
    "move:Sludge Wave": 218,
    "move:Snarl": 219,
    "move:Spacial Rend": 220,
    "move:Spiky Shield": 221,
    "move:Spirit Break": 222,
    "move:Spore": 223,
    "move:Stealth Rock": 224,
    "move:Steel Roller": 225,
    "move:Stomping Tantrum": 226,
    "move:Stone Edge": 227,
    "move:Strange Steam": 228,
    "move:Struggle": 229,
    "move:Struggle Bug": 230,
    "move:Substitute": 231,
    "move:Sucker Punch": 232,
    "move:Sunny Day": 233,
    "move:Sunsteel Strike": 234,
    "move:Supercell Slam": 235,
    "move:Surging Strikes": 236,
    "move:Swords Dance": 237,
    "move:Tachyon Cutter": 238,
    "move:Tailwind": 239,
    "move:Taunt": 240,
    "move:Tera Blast": 241,
    "move:Tera Starstorm": 242,
    "move:Throat Chop": 243,
    "move:Thunder": 244,
    "move:Thunder Punch": 245,
    "move:Thunder Wave": 246,
    "move:Thunderbolt": 247,
    "move:Thunderclap": 248,
    "move:Tickle": 249,
    "move:Topsy-Turvy": 250,
    "move:Toxic": 251,
    "move:Toxic Spikes": 252,
    "move:Trick": 253,
    "move:Trick Room": 254,
    "move:Triple Axel": 255,
    "move:U-turn": 256,
    "move:Upper Hand": 257,
    "move:Vacuum Wave": 258,
    "move:Volt Switch": 259,
    "move:Water Pledge": 260,
    "move:Water Spout": 261,
    "move:Waterfall": 262,
    "move:Wave Crash": 263,
    "move:Weather Ball": 264,
    "move:Whirlwind": 265,
    "move:Wicked Blow": 266,
    "move:Wide Guard": 267,
    "move:Wild Charge": 268,
    "move:Wildbolt Storm": 269,
    "move:Will-O-Wisp": 270,
    "move:Wood Hammer": 271,
    "move:Yawn": 272,
    "switch:Amoonguss": 273,
    "switch:Annihilape": 274,
    "switch:Araquanid": 275,
    "switch:Archaludon": 276,
    "switch:Armarouge": 277,
    "switch:Basculegion": 278,
    "switch:Bastiodon": 279,
    "switch:Brute Bonnet": 280,
    "switch:Calyrex-Ice": 281,
    "switch:Calyrex-Shadow": 282,
    "switch:Ceruledge": 283,
    "switch:Chandelure": 284,
    "switch:Chesnaught": 285,
    "switch:Chi-Yu": 286,
    "switch:Chien-Pao": 287,
    "switch:Clefairy": 288,
    "switch:Cobalion": 289,
    "switch:Conkeldurr": 290,
    "switch:Cresselia": 291,
    "switch:Ditto": 292,
    "switch:Dondozo": 293,
    "switch:Dragapult": 294,
    "switch:Dragonite": 295,
    "switch:Dusclops": 296,
    "switch:Enamorus-Therian": 297,
    "switch:Entei": 298,
    "switch:Eternatus": 299,
    "switch:Excadrill": 300,
    "switch:Farigiraf": 301,
    "switch:Flamigo": 302,
    "switch:Flutter Mane": 303,
    "switch:Gallade": 304,
    "switch:Gardevoir": 305,
    "switch:Garganacl": 306,
    "switch:Gholdengo": 307,
    "switch:Giratina-Origin": 308,
    "switch:Gothitelle": 309,
    "switch:Grimmsnarl": 310,
    "switch:Groudon": 311,
    "switch:Heatran": 312,
    "switch:Hitmontop": 313,
    "switch:Ho-Oh": 314,
    "switch:Incineroar": 315,
    "switch:Indeedee": 316,
    "switch:Indeedee-F": 317,
    "switch:Infernape": 318,
    "switch:Iron Bundle": 319,
    "switch:Iron Crown": 320,
    "switch:Iron Hands": 321,
    "switch:Iron Jugulis": 322,
    "switch:Iron Leaves": 323,
    "switch:Iron Treads": 324,
    "switch:Iron Valiant": 325,
    "switch:Jigglypuff": 326,
    "switch:Jumpluff": 327,
    "switch:Kingambit": 328,
    "switch:Koraidon": 329,
    "switch:Kyogre": 330,
    "switch:Kyurem-Black": 331,
    "switch:Kyurem-White": 332,
    "switch:Landorus": 333,
    "switch:Landorus-Therian": 334,
    "switch:Lugia": 335,
    "switch:Lunala": 336,
    "switch:Malamar": 337,
    "switch:Maushold": 338,
    "switch:Maushold-Four": 339,
    "switch:Mienshao": 340,
    "switch:Miraidon": 341,
    "switch:Moltres-Galar": 342,
    "switch:Mudsdale": 343,
    "switch:Munkidori": 344,
    "switch:Murkrow": 345,
    "switch:Necrozma-Dawn-Wings": 346,
    "switch:Necrozma-Dusk-Mane": 347,
    "switch:Ninetales-Alola": 348,
    "switch:Ogerpon": 349,
    "switch:Ogerpon-Cornerstone": 350,
    "switch:Ogerpon-Hearthflame": 351,
    "switch:Ogerpon-Wellspring": 352,
    "switch:Ogerpon-Wellspring-Tera": 353,
    "switch:Okidogi": 354,
    "switch:Oranguru": 355,
    "switch:Overqwil": 356,
    "switch:Palafin-Hero": 357,
    "switch:Palkia": 358,
    "switch:Pelipper": 359,
    "switch:Persian-Alola": 360,
    "switch:Qwilfish-Hisui": 361,
    "switch:Raging Bolt": 362,
    "switch:Raichu": 363,
    "switch:Rayquaza": 364,
    "switch:Regigigas": 365,
    "switch:Reshiram": 366,
    "switch:Rhydon": 367,
    "switch:Rhyperior": 368,
    "switch:Rillaboom": 369,
    "switch:Roaring Moon": 370,
    "switch:Sableye": 371,
    "switch:Salazzle": 372,
    "switch:Sceptile": 373,
    "switch:Scovillain": 374,
    "switch:Scraggy": 375,
    "switch:Scream Tail": 376,
    "switch:Sinistcha": 377,
    "switch:Sinistcha-Masterpiece": 378,
    "switch:Skeledirge": 379,
    "switch:Slowking": 380,
    "switch:Slowpoke": 381,
    "switch:Smeargle": 382,
    "switch:Sneasler": 383,
    "switch:Suicune": 384,
    "switch:Sylveon": 385,
    "switch:Talonflame": 386,
    "switch:Tatsugiri": 387,
    "switch:Tatsugiri-Droopy": 388,
    "switch:Terapagos": 389,
    "switch:Terapagos-Stellar": 390,
    "switch:Terapagos-Terastal": 391,
    "switch:Ting-Lu": 392,
    "switch:Toedscruel": 393,
    "switch:Torkoal": 394,
    "switch:Tornadus": 395,
    "switch:Tsareena": 396,
    "switch:Tyranitar": 397,
    "switch:Ursaluna": 398,
    "switch:Ursaluna-Bloodmoon": 399,
    "switch:Urshifu": 400,
    "switch:Urshifu-Rapid-Strike": 401,
    "switch:Venusaur": 402,
    "switch:Volcarona": 403,
    "switch:Walking Wake": 404,
    "switch:Weezing": 405,
    "switch:Weezing-Galar": 406,
    "switch:Whimsicott": 407,
    "switch:Wo-Chien": 408,
    "switch:Zacian-Crowned": 409,
    "switch:Zamazenta-Crowned": 410
  },
  "moves": {
    "<pad>": 0,
    "<unknown>": 1,
    "Acid Spray": 2,
    "Acrobatics": 3,
    "Aerial Ace": 4,
    "Aeroblast": 5,
    "After You": 6,
    "Alluring Voice": 7,
    "Ally Switch": 8,
    "Aqua Jet": 9,
    "Armor Cannon": 10,
    "Astral Barrage": 11,
    "Aura Sphere": 12,
    "Aurora Veil": 13,
    "Baneful Bunker": 14,
    "Barb Barrage": 15,
    "Baton Pass": 16,
    "Beat Up": 17,
    "Behemoth Bash": 18,
    "Behemoth Blade": 19,
    "Bitter Blade": 20,
    "Bleakwind Storm": 21,
    "Blood Moon": 22,
    "Blue Flare": 23,
    "Body Press": 24,
    "Brave Bird": 25,
    "Breaking Swipe": 26,
    "Bulk Up": 27,
    "Bulldoze": 28,
    "Bullet Seed": 29,
    "Calm Mind": 30,
    "Clear Smog": 31,
    "Close Combat": 32,
    "Coaching": 33,
    "Collision Course": 34,
    "Cosmic Power": 35,
    "Crunch": 36,
    "Curse": 37,
    "Dark Pulse": 38,
    "Dazzling Gleam": 39,
    "Decorate": 40,
    "Detect": 41,
    "Dire Claw": 42,
    "Disable": 43,
    "Discharge": 44,
    "Double-Edge": 45,
    "Draco Meteor": 46,
    "Dragon Ascent": 47,
    "Dragon Cheer": 48,
    "Dragon Darts": 49,
    "Dragon Pulse": 50,
    "Drain Punch": 51,
    "Draining Kiss": 52,
    "Drum Beating": 53,
    "Dynamax Cannon": 54,
    "Earth Power": 55,
    "Earthquake": 56,
    "Electro Drift": 57,
    "Electro Shot": 58,
    "Electroweb": 59,
    "Encore": 60,
    "Endeavor": 61,
    "Energy Ball": 62,
    "Eruption": 63,
    "Expanding Force": 64,
    "Explosion": 65,
    "Extreme Speed": 66,
    "Facade": 67,
    "Fake Out": 68,
    "Fake Tears": 69,
    "Feint": 70,
    "Fiery Dance": 71,
    "Fiery Wrath": 72,
    "Final Gambit": 73,
    "Fire Blast": 74,
    "Fire Punch": 75,
    "Fire Spin": 76,
    "Fissure": 77,
    "Flame Charge": 78,
    "Flamethrower": 79,
    "Flare Blitz": 80,
    "Flash Cannon": 81,
    "Focus Energy": 82,
    "Follow Me": 83,
    "Foul Play": 84,
    "Freeze-Dry": 85,
    "Fusion Bolt": 86,
    "Fusion Flare": 87,
    "Giga Drain": 88,
    "Giga Impact": 89,
    "Glacial Lance": 90,
    "Grass Knot": 91,
    "Grass Pledge": 92,
    "Grassy Glide": 93,
    "Gravity": 94,
    "Gunk Shot": 95,
    "Haze": 96,
    "Headlong Rush": 97,
    "Heal Pulse": 98,
    "Healing Wish": 99,
    "Heat Crash": 100,
    "Heat Wave": 101,
    "Heavy Slam": 102,
    "Helping Hand": 103,
    "Hex": 104,
    "High Horsepower": 105,
    "Horn Leech": 106,
    "Howl": 107,
    "Hurricane": 108,
    "Hydro Pump": 109,
    "Hydro Steam": 110,
    "Hyper Beam": 111,
    "Hyper Voice": 112,
    "Ice Beam": 113,
    "Ice Punch": 114,
    "Ice Shard": 115,
    "Ice Spinner": 116,
    "Icicle Crash": 117,
    "Icicle Spear": 118,
    "Icy Wind": 119,
    "Imprison": 120,
    "Infestation": 121,
    "Instruct": 122,
    "Iron Defense": 123,
    "Iron Head": 124,
    "Ivy Cudgel": 125,
    "Jet Punch": 126,
    "Knock Off": 127,
    "Kowtow Cleave": 128,
    "Lash Out": 129,
    "Last Respects": 130,
    "Leaf Blade": 131,
    "Leaf Storm": 132,
    "Leech Life": 133,
    "Leech Seed": 134,
    "Leer": 135,
    "Life Dew": 136,
    "Light Screen": 137,
    "Liquidation": 138,
    "Low Kick": 139,
    "Lunar Blessing": 140,
    "Luster Purge": 141,
    "Magma Storm": 142,
    "Make It Rain": 143,
    "Matcha Gotcha": 144,
    "Memento": 145,
    "Meteor Beam": 146,
    "Minimize": 147,
    "Misty Explosion": 148,
    "Misty Terrain": 149,
    "Moonblast": 150,
    "Moongeist Beam": 151,
    "Morning Sun": 152,
    "Mortal Spin": 153,
    "Muddy Water": 154,
    "Mystical Fire": 155,
    "Nasty Plot": 156,
    "Night Slash": 157,
    "Nuzzle": 158,
    "Order Up": 159,
    "Origin Pulse": 160,
    "Outrage": 161,
    "Overheat": 162,
    "Parabolic Charge": 163,
    "Parting Shot": 164,
    "Perish Song": 165,
    "Photon Geyser": 166,
    "Play Rough": 167,
    "Poison Gas": 168,
    "Poison Jab": 169,
    "Pollen Puff": 170,
    "Poltergeist": 171,
    "Population Bomb": 172,
    "Power Gem": 173,
    "Power Split": 174,
    "Power Whip": 175,
    "Precipice Blades": 176,
    "Protect": 177,
    "Psyblade": 178,
    "Psych Up": 179,
    "Psychic": 180,
    "Psychic Noise": 181,
    "Psyshock": 182,
    "Psystrike": 183,
    "Quash": 184,
    "Quick Attack": 185,
    "Quick Guard": 186,
    "Quiver Dance": 187,
    "Rage Fist": 188,
    "Rage Powder": 189,
    "Rain Dance": 190,
    "Recover": 191,
    "Reflect": 192,
    "Rising Voltage": 193,
    "Roar": 194,
    "Rock Slide": 195,
    "Rock Tomb": 196,
    "Ruination": 197,
    "Sacred Fire": 198,
    "Sacred Sword": 199,
    "Salt Cure": 200,
    "Sand Tomb": 201,
    "Sandsear Storm": 202,
    "Scald": 203,
    "Scale Shot": 204,
    "Scary Face": 205,
    "Seed Bomb": 206,
    "Shadow Ball": 207,
    "Shadow Claw": 208,
    "Shadow Force": 209,
    "Shadow Sneak": 210,
    "Shed Tail": 211,
    "Sing": 212,
    "Skill Swap": 213,
    "Slack Off": 214,
    "Sleep Powder": 215,
    "Sludge Bomb": 216,
    "Sludge Wave": 217,
    "Snarl": 218,
    "Spacial Rend": 219,
    "Spiky Shield": 220,
    "Spirit Break": 221,
    "Spore": 222,
    "Stealth Rock": 223,
    "Steel Roller": 224,
    "Stomping Tantrum": 225,
    "Stone Edge": 226,
    "Strange Steam": 227,
    "Struggle": 228,
    "Struggle Bug": 229,
    "Substitute": 230,
    "Sucker Punch": 231,
    "Sunny Day": 232,
    "Sunsteel Strike": 233,
    "Supercell Slam": 234,
    "Surging Strikes": 235,
    "Swords Dance": 236,
    "Tachyon Cutter": 237,
    "Tailwind": 238,
    "Taunt": 239,
    "Tera Blast": 240,
    "Tera Starstorm": 241,
    "Throat Chop": 242,
    "Thunder": 243,
    "Thunder Punch": 244,
    "Thunder Wave": 245,
    "Thunderbolt": 246,
    "Thunderclap": 247,
    "Tickle": 248,
    "Topsy-Turvy": 249,
    "Toxic": 250,
    "Toxic Spikes": 251,
    "Trick": 252,
    "Trick Room": 253,
    "Triple Axel": 254,
    "U-turn": 255,
    "Upper Hand": 256,
    "Vacuum Wave": 257,
    "Volt Switch": 258,
    "Water Pledge": 259,
    "Water Spout": 260,
    "Waterfall": 261,
    "Wave Crash": 262,
    "Weather Ball": 263,
    "Whirlwind": 264,
    "Wicked Blow": 265,
    "Wide Guard": 266,
    "Wild Charge": 267,
    "Wildbolt Storm": 268,
    "Will-O-Wisp": 269,
    "Wood Hammer": 270,
    "Yawn": 271
  },
  "abilities": {
    "<pad>": 0,
    "<unknown>": 1,
    "Air Lock": 2,
    "Beads of Ruin": 3,
    "Berserk": 4,
    "Chilling Neigh": 5,
    "Dauntless Shield": 6,
    "Defiant": 7,
    "Download": 8,
    "Drizzle": 9,
    "Drought": 10,
    "Dry Skin": 11,
    "Embody Aspect (Cornerstone)": 12,
    "Embody Aspect (Hearthflame)": 13,
    "Embody Aspect (Teal)": 14,
    "Embody Aspect (Wellspring)": 15,
    "Flame Body": 16,
    "Frisk": 17,
    "Grassy Surge": 18,
    "Grim Neigh": 19,
    "Guard Dog": 20,
    "Hadron Engine": 21,
    "Hospitality": 22,
    "Inner Focus": 23,
    "Intimidate": 24,
    "Intrepid Sword": 25,
    "Mold Breaker": 26,
    "Moody": 27,
    "Neutralizing Gas": 28,
    "Orichalcum Pulse": 29,
    "Own Tempo": 30,
    "Power of Alchemy": 31,
    "Pressure": 32,
    "Psychic Surge": 33,
    "Sand Stream": 34,
    "Scrappy": 35,
    "Snow Warning": 36,
    "Stamina": 37,
    "Sturdy": 38,
    "Sword of Ruin": 39,
    "Tablets of Ruin": 40,
    "Teraform Zero": 41,
    "Teravolt": 42,
    "Toxic Chain": 43,
    "Turboblaze": 44,
    "Unnerve": 45,
    "Vessel of Ruin": 46,
    "Water Absorb": 47,
    "Weak Armor": 48
  },
  "items": {
    "<pad>": 0,
    "<unknown>": 1,
    "Ability Shield": 2,
    "Assault Vest": 3,
    "Black Sludge": 4,
    "Booster Energy": 5,
    "Choice Band": 6,
    "Choice Scarf": 7,
    "Choice Specs": 8,
    "Chople Berry": 9,
    "Clear Amulet": 10,
    "Covert Cloak": 11,
    "Eject Button": 12,
    "Eject Pack": 13,
    "Electric Seed": 14,
    "Fairy Feather": 15,
    "Flame Orb": 16,
    "Focus Sash": 17,
    "Grassy Seed": 18,
    "Icicle Plate": 19,
    "Leftovers": 20,
    "Life Orb": 21,
    "Light Clay": 22,
    "Magnet": 23,
    "Mental Herb": 24,
    "Mirror Herb": 25,
    "Mystic Water": 26,
    "Normal Gem": 27,
    "Power Herb": 28,
    "Psychic Seed": 29,
    "Rocky Helmet": 30,
    "Room Service": 31,
    "Rusted Shield": 32,
    "Safety Goggles": 33,
    "Shuca Berry": 34,
    "Sitrus Berry": 35,
    "Spell Tag": 36,
    "Throat Spray": 37,
    "Weakness Policy": 38,
    "White Herb": 39,
    "Wide Lens": 40
  },
  "tera_types": {
    "<pad>": 0,
    "<unknown>": 1,
    "Bug": 2,
    "Dark": 3,
    "Dragon": 4,
    "Electric": 5,
    "Fairy": 6,
    "Fighting": 7,
    "Fire": 8,
    "Flying": 9,
    "Ghost": 10,
    "Grass": 11,
    "Ground": 12,
    "Ice": 13,
    "Normal": 14,
    "Poison": 15,
    "Psychic": 16,
    "Rock": 17,
    "Steel": 18,
    "Stellar": 19,
    "Water": 20
  },
  "num_species": 209,
  "num_actions": 411,
  "num_moves": 272,
  "num_abilities": 49,
  "num_items": 41,
  "num_tera_types": 21
}