{
  "species": {
    "<pad>": 0,
    "<unknown>": 1,
    "Abomasnow": 2,
    "Aipom": 3,
    "Alcremie": 4,
    "Alcremie-Caramel-Swirl": 5,
    "Alcremie-Lemon-Cream": 6,
    "Alcremie-Matcha-Cream": 7,
    "Alcremie-Mint-Cream": 8,
    "Alcremie-Rainbow-Swirl": 9,
    "Alcremie-Ruby-Cream": 10,
    "Alcremie-Ruby-Swirl": 11,
    "Alcremie-Salted-Cream": 12,
    "Alomomola": 13,
    "Altaria": 14,
    "Ambipom": 15,
    "Amoonguss": 16,
    "Ampharos": 17,
    "Annihilape": 18,
    "Appletun": 19,
    "Applin": 20,
    "Araquanid": 21,
    "Arbok": 22,
    "Arboliva": 23,
    "Arcanine": 24,
    "Arcanine-Hisui": 25,
    "Arceus-Fairy": 26,
    "Archaludon": 27,
    "Archeops": 28,
    "Arctibax": 29,
    "Arctozolt": 30,
    "Ariados": 31,
    "Armaldo": 32,
    "Armarouge": 33,
    "Articuno": 34,
    "Articuno-Galar": 35,
    "Avalugg": 36,
    "Avalugg-Hisui": 37,
    "Axew": 38,
    "Azelf": 39,
    "Azumarill": 40,
    "Azurill": 41,
    "Bagon": 42,
    "Banette": 43,
    "Banette-Mega": 44,
    "Barraskewda": 45,
    "Basculegion": 46,
    "Basculegion-F": 47,
    "Basculin": 48,
    "Basculin-Blue-Striped": 49,
    "Basculin-White-Striped": 50,
    "Bastiodon": 51,
    "Baxcalibur": 52,
    "Bayleef": 53,
    "Beartic": 54,
    "Bellibolt": 55,
    "Bellossom": 56,
    "Bergmite": 57,
    "Bisharp": 58,
    "Blastoise": 59,
    "Blastoise-Mega": 60,
    "Blaziken": 61,
    "Blissey": 62,
    "Blitzle": 63,
    "Bombirdier": 64,
    "Bonsly": 65,
    "Braixen": 66,
    "Brambleghast": 67,
    "Braviary": 68,
    "Braviary-Hisui": 69,
    "Breloom": 70,
    "Brionne": 71,
    "Bronzong": 72,
    "Bronzor": 73,
    "Brute Bonnet": 74,
    "Bruxish": 75,
    "Buizel": 76,
    "Bulbasaur": 77,
    "Cacnea": 78,
    "Cacturne": 79,
    "Calyrex": 80,
    "Calyrex-Ice": 81,
    "Calyrex-Shadow": 82,
    "Camerupt": 83,
    "Camerupt-Mega": 84,
    "Capsakid": 85,
    "Carbink": 86,
    "Carkol": 87,
    "Castform": 88,
    "Ceruledge": 89,
    "Cetitan": 90,
    "Cetoddle": 91,
    "Chandelure": 92,
    "Chansey": 93,
    "Charizard": 94,
    "Charizard-Mega-Y": 95,
    "Charjabug": 96,
    "Charmander": 97,
    "Chesnaught": 98,
    "Chespin": 99,
    "Chi-Yu": 100,
    "Chien-Pao": 101,
    "Chikorita": 102,
    "Chimecho": 103,
    "Chinchou": 104,
    "Chingling": 105,
    "Cinccino": 106,
    "Cinderace": 107,
    "Clauncher": 108,
    "Clawitzer": 109,
    "Clefable": 110,
    "Clefairy": 111,
    "Cleffa": 112,
    "Clodsire": 113,
    "Cloyster": 114,
    "Coalossal": 115,
    "Cobalion": 116,
    "Cofagrigus": 117,
    "Combee": 118,
    "Combusken": 119,
    "Comfey": 120,
    "Conkeldurr": 121,
    "Copperajah": 122,
    "Corphish": 123,
    "Corviknight": 124,
    "Corvisquire": 125,
    "Cosmoem": 126,
    "Cosmog": 127,
    "Cottonee": 128,
    "Crabominable": 129,
    "Crabrawler": 130,
    "Cramorant": 131,
    "Cranidos": 132,
    "Crawdaunt": 133,
    "Cresselia": 134,
    "Croagunk": 135,
    "Crocalor": 136,
    "Croconaw": 137,
    "Cryogonal": 138,
    "Cubchoo": 139,
    "Cufant": 140,
    "Cutiefly": 141,
    "Cyclizar": 142,
    "Cyndaquil": 143,
    "Dachsbun": 144,
    "Decidueye": 145,
    "Decidueye-Hisui": 146,
    "Dedenne": 147,
    "Delibird": 148,
    "Delphox": 149,
    "Deoxys-Attack": 150,
    "Dewgong": 151,
    "Dewpider": 152,
    "Dialga": 153,
    "Dialga-Origin": 154,
    "Diancie": 155,
    "Diglett": 156,
    "Diglett-Alola": 157,
    "Dipplin": 158,
    "Ditto": 159,
    "Dodrio": 160,
    "Doduo": 161,
    "Dondozo": 162,
    "Donphan": 163,
    "Dragalge": 164,
    "Dragapult": 165,
    "Dragonair": 166,
    "Dragonite": 167,
    "Drakloak": 168,
    "Dratini": 169,
    "Drednaw": 170,
    "Dreepy": 171,
    "Drifblim": 172,
    "Drifloon": 173,
    "Drilbur": 174,
    "Drowzee": 175,
    "Ducklett": 176,
    "Dudunsparce": 177,
    "Dudunsparce-*": 178,
    "Dudunsparce-Three-Segment": 179,
    "Dugtrio": 180,
    "Dugtrio-Alola": 181,
    "Dunsparce": 182,
    "Duosion": 183,
    "Duraludon": 184,
    "Dusclops": 185,
    "Dusknoir": 186,
    "Duskull": 187,
    "Eelektrik": 188,
    "Eelektross": 189,
    "Eevee": 190,
    "Eiscue": 191,
    "Eiscue-Noice": 192,
    "Electabuzz": 193,
    "Electivire": 194,
    "Electrode": 195,
    "Electrode-Hisui": 196,
    "Elekid": 197,
    "Emboar": 198,
    "Emolga": 199,
    "Empoleon": 200,
    "Enamorus": 201,
    "Enamorus-Therian": 202,
    "Entei": 203,
    "Escavalier": 204,
    "Espathra": 205,
    "Espeon": 206,
    "Espurr": 207,
    "Eternatus": 208,
    "Excadrill": 209,
    "Exeggcute": 210,
    "Exeggutor": 211,
    "Exeggutor-Alola": 212,
    "Falinks": 213,
    "Farigiraf": 214,
    "Feebas": 215,
    "Feraligatr": 216,
    "Fezandipiti": 217,
    "Fidough": 218,
    "Finneon": 219,
    "Flaaffy": 220,
    "Flabe\u0301be\u0301": 221,
    "Flamigo": 222,
    "Flapple": 223,
    "Flareon": 224,
    "Fletchinder": 225,
    "Fletchling": 226,
    "Flittle": 227,
    "Floatzel": 228,
    "Floette": 229,
    "Floette-Yellow": 230,
    "Florges": 231,
    "Florges-Blue": 232,
    "Florges-Orange": 233,
    "Florges-White": 234,
    "Florges-Yellow": 235,
    "Flutter Mane": 236,
    "Flygon": 237,
    "Foongus": 238,
    "Forretress": 239,
    "Fraxure": 240,
    "Froakie": 241,
    "Froslass": 242,
    "Frosmoth": 243,
    "Furret": 244,
    "Gabite": 245,
    "Gallade": 246,
    "Gallade-Mega": 247,
    "Galvantula": 248,
    "Garchomp": 249,
    "Gardevoir": 250,
    "Gardevoir-Mega": 251,
    "Garganacl": 252,
    "Gastly": 253,
    "Gastrodon": 254,
    "Gastrodon-East": 255,
    "Gengar": 256,
    "Gengar-Mega": 257,
    "Geodude-Alola": 258,
    "Gholdengo": 259,
    "Gible": 260,
    "Gimmighoul-Roaming": 261,
    "Girafarig": 262,
    "Giratina": 263,
    "Giratina-Origin": 264,
    "Glaceon": 265,
    "Glalie": 266,
    "Glastrier": 267,
    "Gligar": 268,
    "Glimmet": 269,
    "Glimmora": 270,
    "Gliscor": 271,
    "Gloom": 272,
    "Gogoat": 273,
    "Golduck": 274,
    "Golem": 275,
    "Golem-Alola": 276,
    "Golett": 277,
    "Golurk": 278,
    "Goodra": 279,
    "Goodra-Hisui": 280,
    "Goomy": 281,
    "Gorebyss": 282,
    "Gothita": 283,
    "Gothitelle": 284,
    "Gothorita": 285,
    "Gouging Fire": 286,
    "Grafaiai": 287,
    "Granbull": 288,
    "Grapploct": 289,
    "Graveler": 290,
    "Graveler-Alola": 291,
    "Great Tusk": 292,
    "Greavard": 293,
    "Greedent": 294,
    "Greninja": 295,
    "Greninja-*": 296,
    "Grimer-Alola": 297,
    "Grimmsnarl": 298,
    "Grookey": 299,
    "Grotle": 300,
    "Groudon": 301,
    "Grovyle": 302,
    "Growlithe": 303,
    "Growlithe-Hisui": 304,
    "Grumpig": 305,
    "Gulpin": 306,
    "Gumshoos": 307,
    "Gurdurr": 308,
    "Gyarados": 309,
    "Hakamo-o": 310,
    "Happiny": 311,
    "Hariyama": 312,
    "Hatterene": 313,
    "Hattrem": 314,
    "Haunter": 315,
    "Hawlucha": 316,
    "Haxorus": 317,
    "Heatran": 318,
    "Heliolisk": 319,
    "Heracross": 320,
    "Hippopotas": 321,
    "Hippowdon": 322,
    "Hitmonchan": 323,
    "Hitmonlee": 324,
    "Hitmontop": 325,
    "Ho-Oh": 326,
    "Honchkrow": 327,
    "Hoopa-Unbound": 328,
    "Hoppip": 329,
    "Horsea": 330,
    "Houndoom": 331,
    "Houndour": 332,
    "Houndstone": 333,
    "Hydrapple": 334,
    "Hydreigon": 335,
    "Hypno": 336,
    "Igglybuff": 337,
    "Illumise": 338,
    "Impidimp": 339,
    "Incineroar": 340,
    "Indeedee": 341,
    "Indeedee-F": 342,
    "Infernape": 343,
    "Inkay": 344,
    "Inteleon": 345,
    "Iron Boulder": 346,
    "Iron Bundle": 347,
    "Iron Crown": 348,
    "Iron Hands": 349,
    "Iron Jugulis": 350,
    "Iron Leaves": 351,
    "Iron Moth": 352,
    "Iron Thorns": 353,
    "Iron Treads": 354,
    "Iron Valiant": 355,
    "Ivysaur": 356,
    "Jigglypuff": 357,
    "Jolteon": 358,
    "Joltik": 359,
    "Jumpluff": 360,
    "Kecleon": 361,
    "Kilowattrel": 362,
    "Kingambit": 363,
    "Kingdra": 364,
    "Kirlia": 365,
    "Klawf": 366,
    "Kleavor": 367,
    "Klefki": 368,
    "Koffing": 369,
    "Komala": 370,
    "Kommo-o": 371,
    "Koraidon": 372,
    "Kricketot": 373,
    "Kricketune": 374,
    "Krokorok": 375,
    "Krookodile": 376,
    "Kubfu": 377,
    "Kyogre": 378,
    "Kyurem": 379,
    "Kyurem-Black": 380,
    "Kyurem-White": 381,
    "Lampent": 382,
    "Landorus": 383,
    "Landorus-Therian": 384,
    "Lanturn": 385,
    "Lapras": 386,
    "Larvesta": 387,
    "Larvitar": 388,
    "Latias": 389,
    "Latios": 390,
    "Leafeon": 391,
    "Leavanny": 392,
    "Lechonk": 393,
    "Liepard": 394,
    "Lilligant": 395,
    "Lilligant-Hisui": 396,
    "Litleo": 397,
    "Litten": 398,
    "Litwick": 399,
    "Lokix": 400,
    "Lombre": 401,
    "Lucario": 402,
    "Ludicolo": 403,
    "Lugia": 404,
    "Lumineon": 405,
    "Lunala": 406,
    "Lunatone": 407,
    "Lurantis": 408,
    "Luvdisc": 409,
    "Luxio": 410,
    "Luxray": 411,
    "Lycanroc": 412,
    "Lycanroc-Dusk": 413,
    "Lycanroc-Midnight": 414,
    "Mabosstiff": 415,
    "Magby": 416,
    "Magcargo": 417,
    "Magikarp": 418,
    "Magmar": 419,
    "Magmortar": 420,
    "Magnemite": 421,
    "Magneton": 422,
    "Magnezone": 423,
    "Makuhita": 424,
    "Malamar": 425,
    "Mamoswine": 426,
    "Mandibuzz": 427,
    "Mankey": 428,
    "Mareanie": 429,
    "Mareep": 430,
    "Marill": 431,
    "Marshtomp": 432,
    "Maschiff": 433,
    "Masquerain": 434,
    "Maushold": 435,
    "Maushold-Four": 436,
    "Medicham": 437,
    "Meditite": 438,
    "Meganium": 439,
    "Meowscarada": 440,
    "Meowstic": 441,
    "Meowstic-F": 442,
    "Meowth": 443,
    "Meowth-Alola": 444,
    "Meowth-Galar": 445,
    "Mesprit": 446,
    "Metagross": 447,
    "Metang": 448,
    "Mew": 449,
    "Mewtwo": 450,
    "Mewtwo-Mega-Y": 451,
    "Mienfoo": 452,
    "Mienshao": 453,
    "Mightyena": 454,
    "Milotic": 455,
    "Mimikyu": 456,
    "Mimikyu-Busted": 457,
    "Minccino": 458,
    "Minior": 459,
    "Minior-Blue": 460,
    "Minior-Green": 461,
    "Minior-Indigo": 462,
    "Minior-Orange": 463,
    "Minior-Violet": 464,
    "Minior-Yellow": 465,
    "Minun": 466,
    "Miraidon": 467,
    "Misdreavus": 468,
    "Mismagius": 469,
    "Moltres": 470,
    "Moltres-Galar": 471,
    "Monferno": 472,
    "Morgrem": 473,
    "Morpeko": 474,
    "Mudbray": 475,
    "Mudkip": 476,
    "Mudsdale": 477,
    "Muk": 478,
    "Muk-Alola": 479,
    "Munchlax": 480,
    "Munkidori": 481,
    "Murkrow": 482,
    "Nacli": 483,
    "Naclstack": 484,
    "Naganadel": 485,
    "Necrozma": 486,
    "Necrozma-Dawn-Wings": 487,
    "Necrozma-Dusk-Mane": 488,
    "Ninetales": 489,
    "Ninetales-Alola": 490,
    "Noctowl": 491,
    "Noivern": 492,
    "Nosepass": 493,
    "Numel": 494,
    "Nuzleaf": 495,
    "Oddish": 496,
    "Ogerpon": 497,
    "Ogerpon-Cornerstone": 498,
    "Ogerpon-Cornerstone-Tera": 499,
    "Ogerpon-Hearthflame": 500,
    "Ogerpon-Hearthflame-Tera": 501,
    "Ogerpon-Teal-Tera": 502,
    "Ogerpon-Wellspring": 503,
    "Ogerpon-Wellspring-Tera": 504,
    "Oinkologne": 505,
    "Oinkologne-F": 506,
    "Okidogi": 507,
    "Oranguru": 508,
    "Orbeetle": 509,
    "Oricorio": 510,
    "Oricorio-Pa'u": 511,
    "Oricorio-Pom-Pom": 512,
    "Oricorio-Sensu": 513,
    "Orthworm": 514,
    "Oshawott": 515,
    "Overqwil": 516,
    "Pachirisu": 517,
    "Palafin": 518,
    "Palafin-Hero": 519,
    "Palkia": 520,
    "Palkia-Origin": 521,
    "Palossand": 522,
    "Passimian": 523,
    "Pawmi": 524,
    "Pawmo": 525,
    "Pawmot": 526,
    "Pawniard": 527,
    "Pecharunt": 528,
    "Pelipper": 529,
    "Perrserker": 530,
    "Persian": 531,
    "Persian-Alola": 532,
    "Phanpy": 533,
    "Phantump": 534,
    "Pichu": 535,
    "Pignite": 536,
    "Pikachu": 537,
    "Pikachu-Alola": 538,
    "Pikachu-Hoenn": 539,
    "Pikachu-Kalos": 540,
    "Pikachu-Original": 541,
    "Pikachu-Partner": 542,
    "Pikachu-Sinnoh": 543,
    "Pikachu-Unova": 544,
    "Pikachu-World": 545,
    "Piloswine": 546,
    "Pincurchin": 547,
    "Pineco": 548,
    "Piplup": 549,
    "Plusle": 550,
    "Politoed": 551,
    "Poliwag": 552,
    "Poliwhirl": 553,
    "Poliwrath": 554,
    "Poltchageist": 555,
    "Poltchageist-Artisan": 556,
    "Polteageist": 557,
    "Polteageist-Antique": 558,
    "Poochyena": 559,
    "Popplio": 560,
    "Porygon": 561,
    "Porygon-Z": 562,
    "Porygon2": 563,
    "Primarina": 564,
    "Primeape": 565,
    "Prinplup": 566,
    "Probopass": 567,
    "Psyduck": 568,
    "Pyroar": 569,
    "Quagsire": 570,
    "Quaquaval": 571,
    "Quaxly": 572,
    "Quilava": 573,
    "Quilladin": 574,
    "Qwilfish": 575,
    "Qwilfish-Hisui": 576,
    "Raboot": 577,
    "Rabsca": 578,
    "Raging Bolt": 579,
    "Raichu": 580,
    "Raichu-Alola": 581,
    "Raikou": 582,
    "Ralts": 583,
    "Rampardos": 584,
    "Rayquaza": 585,
    "Regice": 586,
    "Regidrago": 587,
    "Regieleki": 588,
    "Regigigas": 589,
    "Regirock": 590,
    "Registeel": 591,
    "Reshiram": 592,
    "Reuniclus": 593,
    "Revavroom": 594,
    "Rhydon": 595,
    "Rhyhorn": 596,
    "Rhyperior": 597,
    "Ribombee": 598,
    "Rillaboom": 599,
    "Riolu": 600,
    "Roaring Moon": 601,
    "Rockruff": 602,
    "Rotom": 603,
    "Rotom-Fan": 604,
    "Rotom-Frost": 605,
    "Rotom-Heat": 606,
    "Rotom-Mow": 607,
    "Rotom-Wash": 608,
    "Rowlet": 609,
    "Sableye": 610,
    "Salamence": 611,
    "Salamence-Mega": 612,
    "Salandit": 613,
    "Salazzle": 614,
    "Samurott": 615,
    "Samurott-Hisui": 616,
    "Sandaconda": 617,
    "Sandile": 618,
    "Sandshrew": 619,
    "Sandshrew-Alola": 620,
    "Sandslash": 621,
    "Sandslash-Alola": 622,
    "Sandy Shocks": 623,
    "Sandygast": 624,
    "Sawsbuck": 625,
    "Sawsbuck-Autumn": 626,
    "Sawsbuck-Summer": 627,
    "Sawsbuck-Winter": 628,
    "Scatterbug": 629,
    "Sceptile": 630,
    "Sceptile-Mega": 631,
    "Scizor": 632,
    "Scorbunny": 633,
    "Scovillain": 634,
    "Scrafty": 635,
    "Scraggy": 636,
    "Scream Tail": 637,
    "Scyther": 638,
    "Seadra": 639,
    "Seedot": 640,
    "Seel": 641,
    "Sentret": 642,
    "Serperior": 643,
    "Servine": 644,
    "Seviper": 645,
    "Sewaddle": 646,
    "Shaymin": 647,
    "Shedinja": 648,
    "Shelgon": 649,
    "Shellder": 650,
    "Shellos": 651,
    "Shieldon": 652,
    "Shiftry": 653,
    "Shinx": 654,
    "Shroodle": 655,
    "Shroomish": 656,
    "Shuppet": 657,
    "Silicobra": 658,
    "Silvally-*": 659,
    "Silvally-Fairy": 660,
    "Sinistcha": 661,
    "Sinistcha-Masterpiece": 662,
    "Sinistea": 663,
    "Skarmory": 664,
    "Skeledirge": 665,
    "Skiploom": 666,
    "Skrelp": 667,
    "Skuntank": 668,
    "Skwovet": 669,
    "Slaking": 670,
    "Sliggoo": 671,
    "Sliggoo-Hisui": 672,
    "Slither Wing": 673,
    "Slowbro": 674,
    "Slowbro-Galar": 675,
    "Slowking": 676,
    "Slowking-Galar": 677,
    "Slowpoke": 678,
    "Slowpoke-Galar": 679,
    "Smeargle": 680,
    "Sneasel": 681,
    "Sneasel-Hisui": 682,
    "Sneasler": 683,
    "Snivy": 684,
    "Snom": 685,
    "Snorlax": 686,
    "Snorunt": 687,
    "Snover": 688,
    "Snubbull": 689,
    "Solgaleo": 690,
    "Solosis": 691,
    "Spectrier": 692,
    "Spewpa": 693,
    "Spidops": 694,
    "Spinarak": 695,
    "Spiritomb": 696,
    "Spoink": 697,
    "Sprigatito": 698,
    "Squawkabilly": 699,
    "Squawkabilly-Blue": 700,
    "Squawkabilly-White": 701,
    "Squawkabilly-Yellow": 702,
    "Squirtle": 703,
    "Stantler": 704,
    "Staraptor": 705,
    "Staravia": 706,
    "Starly": 707,
    "Stonjourner": 708,
    "Stunky": 709,
    "Sudowoodo": 710,
    "Suicune": 711,
    "Sunflora": 712,
    "Sunkern": 713,
    "Surskit": 714,
    "Swablu": 715,
    "Swadloon": 716,
    "Swalot": 717,
    "Swampert": 718,
    "Swampert-Mega": 719,
    "Swanna": 720,
    "Swinub": 721,
    "Sylveon": 722,
    "Talonflame": 723,
    "Tandemaus": 724,
    "Tangrowth": 725,
    "Tarountula": 726,
    "Tatsugiri": 727,
    "Tatsugiri-Droopy": 728,
    "Tatsugiri-Stretchy": 729,
    "Tauros": 730,
    "Tauros-Paldea-Aqua": 731,
    "Tauros-Paldea-Blaze": 732,
    "Tauros-Paldea-Combat": 733,
    "Teddiursa": 734,
    "Tentacool": 735,
    "Tentacruel": 736,
    "Terapagos": 737,
    "Terapagos-Stellar": 738,
    "Terapagos-Terastal": 739,
    "Terrakion": 740,
    "Thievul": 741,
    "Thundurus": 742,
    "Thundurus-Therian": 743,
    "Thwackey": 744,
    "Timburr": 745,
    "Ting-Lu": 746,
    "Tinkatink": 747,
    "Tinkaton": 748,
    "Tinkatuff": 749,
    "Toedscool": 750,
    "Toedscruel": 751,
    "Torchic": 752,
    "Torkoal": 753,
    "Tornadus": 754,
    "Tornadus-Therian": 755,
    "Torracat": 756,
    "Torterra": 757,
    "Totodile": 758,
    "Toucannon": 759,
    "Toxapex": 760,
    "Toxicroak": 761,
    "Toxtricity": 762,
    "Toxtricity-Low-Key": 763,
    "Trapinch": 764,
    "Treecko": 765,
    "Trevenant": 766,
    "Tropius": 767,
    "Tsareena": 768,
    "Typhlosion": 769,
    "Typhlosion-Hisui": 770,
    "Tyranitar": 771,
    "Tyrogue": 772,
    "Umbreon": 773,
    "Ursaluna": 774,
    "Ursaluna-Bloodmoon": 775,
    "Ursaring": 776,
    "Urshifu": 777,
    "Urshifu-*": 778,
    "Urshifu-Rapid-Strike": 779,
    "Uxie": 780,
    "Vaporeon": 781,
    "Varoom": 782,
    "Veluza": 783,
    "Venomoth": 784,
    "Venonat": 785,
    "Venusaur": 786,
    "Venusaur-Mega": 787,
    "Vespiquen": 788,
    "Vibrava": 789,
    "Victreebel": 790,
    "Vigoroth": 791,
    "Vikavolt": 792,
    "Vileplume": 793,
    "Virizion": 794,
    "Vivillon": 795,
    "Vivillon-Archipelago": 796,
    "Vivillon-Continental": 797,
    "Vivillon-Elegant": 798,
    "Vivillon-Fancy": 799,
    "Vivillon-Garden": 800,
    "Vivillon-High Plains": 801,
    "Vivillon-Icy Snow": 802,
    "Vivillon-Jungle": 803,
    "Vivillon-Marine": 804,
    "Vivillon-Modern": 805,
    "Vivillon-Monsoon": 806,
    "Vivillon-Ocean": 807,
    "Vivillon-Pokeball": 808,
    "Vivillon-Polar": 809,
    "Vivillon-Savanna": 810,
    "Vivillon-Sun": 811,
    "Vivillon-Tundra": 812,
    "Volbeat": 813,
    "Volcanion": 814,
    "Volcarona": 815,
    "Voltorb": 816,
    "Voltorb-Hisui": 817,
    "Vullaby": 818,
    "Vulpix": 819,
    "Vulpix-Alola": 820,
    "Walking Wake": 821,
    "Wartortle": 822,
    "Wattrel": 823,
    "Weavile": 824,
    "Weezing": 825,
    "Weezing-Galar": 826,
    "Whimsicott": 827,
    "Whiscash": 828,
    "Wigglytuff": 829,
    "Wingull": 830,
    "Wo-Chien": 831,
    "Wooper": 832,
    "Wooper-Paldea": 833,
    "Wugtrio": 834,
    "Wyrdeer": 835,
    "Yanma": 836,
    "Yanmega": 837,
    "Zacian": 838,
    "Zacian-*": 839,
    "Zacian-Crowned": 840,
    "Zamazenta": 841,
    "Zamazenta-*": 842,
    "Zamazenta-Crowned": 843,
    "Zangoose": 844,
    "Zapdos": 845,
    "Zapdos-Galar": 846,
    "Zebstrika": 847,
    "Zekrom": 848,
    "Zoroark": 849,
    "Zoroark-Hisui": 850,
    "Zorua": 851,
    "Zorua-Hisui": 852,
    "Zweilous": 853
  },
  "actions": {
    "<pad>": 0,
    "<none>": 1,
    "<cant>": 2,
    "move:Absorb": 3,
    "move:Accelerock": 4,
    "move:Acid": 5,
    "move:Acid Armor": 6,
    "move:Acid Spray": 7,
    "move:Acrobatics": 8,
    "move:Acupressure": 9,
    "move:Aerial Ace": 10,
    "move:Aeroblast": 11,
    "move:After You": 12,
    "move:Agility": 13,
    "move:Air Cutter": 14,
    "move:Air Slash": 15,
    "move:Alluring Voice": 16,
    "move:Ally Switch": 17,
    "move:Amnesia": 18,
    "move:Ancient Power": 19,
    "move:Apple Acid": 20,
    "move:Aqua Cutter": 21,
    "move:Aqua Jet": 22,
    "move:Aqua Ring": 23,
    "move:Aqua Step": 24,
    "move:Aqua Tail": 25,
    "move:Arm Thrust": 26,
    "move:Armor Cannon": 27,
    "move:Aromatic Mist": 28,
    "move:Assurance": 29,
    "move:Astonish": 30,
    "move:Astral Barrage": 31,
    "move:Attack Order": 32,
    "move:Attract": 33,
    "move:Aura Sphere": 34,
    "move:Aura Wheel": 35,
    "move:Aurora Beam": 36,
    "move:Aurora Veil": 37,
    "move:Avalanche": 38,
    "move:Axe Kick": 39,
    "move:Baby-Doll Eyes": 40,
    "move:Baneful Bunker": 41,
    "move:Barb Barrage": 42,
    "move:Baton Pass": 43,
    "move:Beak Blast": 44,
    "move:Beat Up": 45,
    "move:Behemoth Bash": 46,
    "move:Behemoth Blade": 47,
    "move:Belch": 48,
    "move:Belly Drum": 49,
    "move:Bind": 50,
    "move:Bite": 51,
    "move:Bitter Blade": 52,
    "move:Bitter Malice": 53,
    "move:Blast Burn": 54,
    "move:Blaze Kick": 55,
    "move:Bleakwind Storm": 56,
    "move:Blizzard": 57,
    "move:Block": 58,
    "move:Blood Moon": 59,
    "move:Blue Flare": 60,
    "move:Body Press": 61,
    "move:Body Slam": 62,
    "move:Bolt Beak": 63,
    "move:Bolt Strike": 64,
    "move:Bone Rush": 65,
    "move:Boomburst": 66,
    "move:Bounce": 67,
    "move:Brave Bird": 68,
    "move:Breaking Swipe": 69,
    "move:Brick Break": 70,
    "move:Brine": 71,
    "move:Brutal Swing": 72,
    "move:Bubble Beam": 73,
    "move:Bug Bite": 74,
    "move:Bug Buzz": 75,
    "move:Bulk Up": 76,
    "move:Bulldoze": 77,
    "move:Bullet Punch": 78,
    "move:Bullet Seed": 79,
    "move:Burn Up": 80,
    "move:Burning Bulwark": 81,
    "move:Burning Jealousy": 82,
    "move:Calm Mind": 83,
    "move:Ceaseless Edge": 84,
    "move:Charge": 85,
    "move:Charge Beam": 86,
    "move:Charm": 87,
    "move:Chilling Water": 88,
    "move:Chilly Reception": 89,
    "move:Chloroblast": 90,
    "move:Circle Throw": 91,
    "move:Clanging Scales": 92,
    "move:Clangorous Soul": 93,
    "move:Clear Smog": 94,
    "move:Close Combat": 95,
    "move:Coaching": 96,
    "move:Coil": 97,
    "move:Collision Course": 98,
    "move:Comeuppance": 99,
    "move:Confide": 100,
    "move:Confuse Ray": 101,
    "move:Confusion": 102,
    "move:Conversion": 103,
    "move:Copycat": 104,
    "move:Corrosive Gas": 105,
    "move:Cosmic Power": 106,
    "move:Cotton Guard": 107,
    "move:Cotton Spore": 108,
    "move:Counter": 109,
    "move:Court Change": 110,
    "move:Covet": 111,
    "move:Crabhammer": 112,
    "move:Cross Chop": 113,
    "move:Cross Poison": 114,
    "move:Crunch": 115,
    "move:Crush Claw": 116,
    "move:Crush Grip": 117,
    "move:Curse": 118,
    "move:Cut": 119,
    "move:Dark Pulse": 120,
    "move:Dark Void": 121,
    "move:Darkest Lariat": 122,
    "move:Dazzling Gleam": 123,
    "move:Decorate": 124,
    "move:Defend Order": 125,
    "move:Defense Curl": 126,
    "move:Defog": 127,
    "move:Destiny Bond": 128,
    "move:Detect": 129,
    "move:Diamond Storm": 130,
    "move:Dig": 131,
    "move:Dire Claw": 132,
    "move:Disable": 133,
    "move:Disarming Voice": 134,
    "move:Discharge": 135,
    "move:Dive": 136,
    "move:Doodle": 137,
    "move:Doom Desire": 138,
    "move:Double Hit": 139,
    "move:Double Kick": 140,
    "move:Double Shock": 141,
    "move:Double Team": 142,
    "move:Double-Edge": 143,
    "move:Draco Meteor": 144,
    "move:Dragon Ascent": 145,
    "move:Dragon Breath": 146,
    "move:Dragon Cheer": 147,
    "move:Dragon Claw": 148,
    "move:Dragon Dance": 149,
    "move:Dragon Darts": 150,
    "move:Dragon Energy": 151,
    "move:Dragon Hammer": 152,
    "move:Dragon Pulse": 153,
    "move:Dragon Rush": 154,
    "move:Dragon Tail": 155,
    "move:Drain Punch": 156,
    "move:Draining Kiss": 157,
    "move:Dream Eater": 158,
    "move:Drill Peck": 159,
    "move:Drill Run": 160,
    "move:Drum Beating": 161,
    "move:Dual Wingbeat": 162,
    "move:Dynamax Cannon": 163,
    "move:Dynamic Punch": 164,
    "move:Earth Power": 165,
    "move:Earthquake": 166,
    "move:Echoed Voice": 167,
    "move:Eerie Impulse": 168,
    "move:Eerie Spell": 169,
    "move:Electric Terrain": 170,
    "move:Electro Ball": 171,
    "move:Electro Drift": 172,
    "move:Electro Shot": 173,
    "move:Electroweb": 174,
    "move:Ember": 175,
    "move:Encore": 176,
    "move:Endeavor": 177,
    "move:Endure": 178,
    "move:Energy Ball": 179,
    "move:Entrainment": 180,
    "move:Eruption": 181,
    "move:Esper Wing": 182,
    "move:Expanding Force": 183,
    "move:Explosion": 184,
    "move:Extrasensory": 185,
    "move:Extreme Speed": 186,
    "move:Facade": 187,
    "move:Fairy Lock": 188,
    "move:Fairy Wind": 189,
    "move:Fake Out": 190,
    "move:Fake Tears": 191,
    "move:False Surrender": 192,
    "move:False Swipe": 193,
    "move:Feather Dance": 194,
    "move:Feint": 195,
    "move:Fell Stinger": 196,
    "move:Fickle Beam": 197,
    "move:Fiery Dance": 198,
    "move:Fiery Wrath": 199,
    "move:Fillet Away": 200,
    "move:Final Gambit": 201,
    "move:Fire Blast": 202,
    "move:Fire Fang": 203,
    "move:Fire Lash": 204,
    "move:Fire Pledge": 205,
    "move:Fire Punch": 206,
    "move:Fire Spin": 207,
    "move:First Impression": 208,
    "move:Fissure": 209,
    "move:Flail": 210,
    "move:Flame Charge": 211,
    "move:Flame Wheel": 212,
    "move:Flamethrower": 213,
    "move:Flare Blitz": 214,
    "move:Flash Cannon": 215,
    "move:Flatter": 216,
    "move:Fling": 217,
    "move:Flip Turn": 218,
    "move:Floral Healing": 219,
    "move:Flower Trick": 220,
    "move:Fly": 221,
    "move:Flying Press": 222,
    "move:Focus Blast": 223,
    "move:Focus Energy": 224,
    "move:Focus Punch": 225,
    "move:Follow Me": 226,
    "move:Force Palm": 227,
    "move:Forest's Curse": 228,
    "move:Foul Play": 229,
    "move:Freeze Shock": 230,
    "move:Freeze-Dry": 231,
    "move:Freezing Glare": 232,
    "move:Frenzy Plant": 233,
    "move:Frost Breath": 234,
    "move:Fury Attack": 235,
    "move:Fury Cutter": 236,
    "move:Fury Swipes": 237,
    "move:Fusion Bolt": 238,
    "move:Fusion Flare": 239,
    "move:Future Sight": 240,
    "move:Gastro Acid": 241,
    "move:Giga Drain": 242,
    "move:Giga Impact": 243,
    "move:Gigaton Hammer": 244,
    "move:Glacial Lance": 245,
    "move:Glaciate": 246,
    "move:Glaive Rush": 247,
    "move:Glare": 248,
    "move:Grass Knot": 249,
    "move:Grass Pledge": 250,
    "move:Grassy Glide": 251,
    "move:Grassy Terrain": 252,
    "move:Grav Apple": 253,
    "move:Gravity": 254,
    "move:Growl": 255,
    "move:Growth": 256,
    "move:Guard Split": 257,
    "move:Guard Swap": 258,
    "move:Guillotine": 259,
    "move:Gunk Shot": 260,
    "move:Gust": 261,
    "move:Gyro Ball": 262,
    "move:Hammer Arm": 263,
    "move:Hard Press": 264,
    "move:Harden": 265,
    "move:Haze": 266,
    "move:Head Smash": 267,
    "move:Headbutt": 268,
    "move:Headlong Rush": 269,
    "move:Heal Bell": 270,
    "move:Heal Pulse": 271,
    "move:Healing Wish": 272,
    "move:Heart Swap": 273,
    "move:Heat Crash": 274,
    "move:Heat Wave": 275,
    "move:Heavy Slam": 276,
    "move:Helping Hand": 277,
    "move:Hex": 278,
    "move:High Horsepower": 279,
    "move:High Jump Kick": 280,
    "move:Hold Back": 281,
    "move:Hone Claws": 282,
    "move:Horn Attack": 283,
    "move:Horn Drill": 284,
    "move:Horn Leech": 285,
    "move:Howl": 286,
    "move:Hurricane": 287,
    "move:Hydro Cannon": 288,
    "move:Hydro Pump": 289,
    "move:Hydro Steam": 290,
    "move:Hyper Beam": 291,
    "move:Hyper Drill": 292,
    "move:Hyper Voice": 293,
    "move:Hypnosis": 294,
    "move:Ice Beam": 295,
    "move:Ice Burn": 296,
    "move:Ice Fang": 297,
    "move:Ice Hammer": 298,
    "move:Ice Punch": 299,
    "move:Ice Shard": 300,
    "move:Ice Spinner": 301,
    "move:Icicle Crash": 302,
    "move:Icicle Spear": 303,
    "move:Icy Wind": 304,
    "move:Imprison": 305,
    "move:Incinerate": 306,
    "move:Infernal Parade": 307,
    "move:Inferno": 308,
    "move:Infestation": 309,
    "move:Ingrain": 310,
    "move:Instruct": 311,
    "move:Iron Defense": 312,
    "move:Iron Head": 313,
    "move:Iron Tail": 314,
    "move:Ivy Cudgel": 315,
    "move:Jaw Lock": 316,
    "move:Jet Punch": 317,
    "move:Judgment": 318,
    "move:Jungle Healing": 319,
    "move:Knock Off": 320,
    "move:Kowtow Cleave": 321,
    "move:Lash Out": 322,
    "move:Last Resort": 323,
    "move:Last Respects": 324,
    "move:Lava Plume": 325,
    "move:Leaf Blade": 326,
    "move:Leaf Storm": 327,
    "move:Leafage": 328,
    "move:Leech Life": 329,
    "move:Leech Seed": 330,
    "move:Leer": 331,
    "move:Lick": 332,
    "move:Life Dew": 333,
    "move:Light Screen": 334,
    "move:Liquidation": 335,
    "move:Lock-On": 336,
    "move:Lovely Kiss": 337,
    "move:Low Kick": 338,
    "move:Low Sweep": 339,
    "move:Lumina Crash": 340,
    "move:Lunar Blessing": 341,
    "move:Lunar Dance": 342,
    "move:Lunge": 343,
    "move:Luster Purge": 344,
    "move:Mach Punch": 345,
    "move:Magic Powder": 346,
    "move:Magic Room": 347,
    "move:Magical Leaf": 348,
    "move:Magma Storm": 349,
    "move:Magnet Rise": 350,
    "move:Magnetic Flux": 351,
    "move:Make It Rain": 352,
    "move:Malignant Chain": 353,
    "move:Matcha Gotcha": 354,
    "move:Mean Look": 355,
    "move:Mega Drain": 356,
    "move:Mega Kick": 357,
    "move:Mega Punch": 358,
    "move:Megahorn": 359,
    "move:Memento": 360,
    "move:Metal Burst": 361,
    "move:Metal Claw": 362,
    "move:Metal Sound": 363,
    "move:Meteor Beam": 364,
    "move:Meteor Mash": 365,
    "move:Metronome": 366,
    "move:Mighty Cleave": 367,
    "move:Milk Drink": 368,
    "move:Mimic": 369,
    "move:Minimize": 370,
    "move:Mirror Coat": 371,
    "move:Mist": 372,
    "move:Mist Ball": 373,
    "move:Misty Explosion": 374,
    "move:Misty Terrain": 375,
    "move:Moonblast": 376,
    "move:Moongeist Beam": 377,
    "move:Moonlight": 378,
    "move:Morning Sun": 379,
    "move:Mortal Spin": 380,
    "move:Mountain Gale": 381,
    "move:Mud Shot": 382,
    "move:Mud-Slap": 383,
    "move:Muddy Water": 384,
    "move:Multi-Attack": 385,
    "move:Mystical Fire": 386,
    "move:Mystical Power": 387,
    "move:Nasty Plot": 388,
    "move:Night Daze": 389,
    "move:Night Shade": 390,
    "move:Night Slash": 391,
    "move:No Retreat": 392,
    "move:Noble Roar": 393,
    "move:Nuzzle": 394,
    "move:Octolock": 395,
    "move:Order Up": 396,
    "move:Origin Pulse": 397,
    "move:Outrage": 398,
    "move:Overdrive": 399,
    "move:Overheat": 400,
    "move:Pain Split": 401,
    "move:Parabolic Charge": 402,
    "move:Parting Shot": 403,
    "move:Pay Day": 404,
    "move:Payback": 405,
    "move:Peck": 406,
    "move:Perish Song": 407,
    "move:Petal Blizzard": 408,
    "move:Petal Dance": 409,
    "move:Phantom Force": 410,
    "move:Photon Geyser": 411,
    "move:Pin Missile": 412,
    "move:Play Nice": 413,
    "move:Play Rough": 414,
    "move:Pluck": 415,
    "move:Poison Fang": 416,
    "move:Poison Gas": 417,
    "move:Poison Jab": 418,
    "move:Poison Powder": 419,
    "move:Poison Sting": 420,
    "move:Poison Tail": 421,
    "move:Pollen Puff": 422,
    "move:Poltergeist": 423,
    "move:Population Bomb": 424,
    "move:Pounce": 425,
    "move:Pound": 426,
    "move:Powder Snow": 427,
    "move:Power Gem": 428,
    "move:Power Split": 429,
    "move:Power Swap": 430,
    "move:Power Trick": 431,
    "move:Power Trip": 432,
    "move:Power Whip": 433,
    "move:Precipice Blades": 434,
    "move:Present": 435,
    "move:Prismatic Laser": 436,
    "move:Protect": 437,
    "move:Psybeam": 438,
    "move:Psyblade": 439,
    "move:Psych Up": 440,
    "move:Psychic": 441,
    "move:Psychic Fangs": 442,
    "move:Psychic Noise": 443,
    "move:Psychic Terrain": 444,
    "move:Psycho Boost": 445,
    "move:Psycho Cut": 446,
    "move:Psyshield Bash": 447,
    "move:Psyshock": 448,
    "move:Psystrike": 449,
    "move:Pyro Ball": 450,
    "move:Quash": 451,
    "move:Quick Attack": 452,
    "move:Quick Guard": 453,
    "move:Quiver Dance": 454,
    "move:Rage Fist": 455,
    "move:Rage Powder": 456,
    "move:Raging Bull": 457,
    "move:Raging Fury": 458,
    "move:Rain Dance": 459,
    "move:Rapid Spin": 460,
    "move:Razor Leaf": 461,
    "move:Razor Shell": 462,
    "move:Recover": 463,
    "move:Recycle": 464,
    "move:Reflect": 465,
    "move:Reflect Type": 466,
    "move:Rest": 467,
    "move:Retaliate": 468,
    "move:Revelation Dance": 469,
    "move:Reversal": 470,
    "move:Revival Blessing": 471,
    "move:Rising Voltage": 472,
    "move:Roar": 473,
    "move:Roar of Time": 474,
    "move:Rock Blast": 475,
    "move:Rock Polish": 476,
    "move:Rock Slide": 477,
    "move:Rock Smash": 478,
    "move:Rock Throw": 479,
    "move:Rock Tomb": 480,
    "move:Rock Wrecker": 481,
    "move:Role Play": 482,
    "move:Rollout": 483,
    "move:Roost": 484,
    "move:Round": 485,
    "move:Ruination": 486,
    "move:Sacred Fire": 487,
    "move:Sacred Sword": 488,
    "move:Safeguard": 489,
    "move:Salt Cure": 490,
    "move:Sand Attack": 491,
    "move:Sand Tomb": 492,
    "move:Sandsear Storm": 493,
    "move:Sandstorm": 494,
    "move:Scald": 495,
    "move:Scale Shot": 496,
    "move:Scary Face": 497,
    "move:Scorching Sands": 498,
    "move:Scratch": 499,
    "move:Screech": 500,
    "move:Secret Sword": 501,
    "move:Seed Bomb": 502,
    "move:Seed Flare": 503,
    "move:Seismic Toss": 504,
    "move:Self-Destruct": 505,
    "move:Shadow Ball": 506,
    "move:Shadow Claw": 507,
    "move:Shadow Force": 508,
    "move:Shadow Punch": 509,
    "move:Shadow Sneak": 510,
    "move:Shed Tail": 511,
    "move:Sheer Cold": 512,
    "move:Shell Side Arm": 513,
    "move:Shell Smash": 514,
    "move:Shelter": 515,
    "move:Shift Gear": 516,
    "move:Shock Wave": 517,
    "move:Shore Up": 518,
    "move:Silk Trap": 519,
    "move:Simple Beam": 520,
    "move:Sing": 521,
    "move:Sketch": 522,
    "move:Skill Swap": 523,
    "move:Skitter Smack": 524,
    "move:Sky Attack": 525,
    "move:Sky Drop": 526,
    "move:Slack Off": 527,
    "move:Slam": 528,
    "move:Slash": 529,
    "move:Sleep Powder": 530,
    "move:Sleep Talk": 531,
    "move:Sludge": 532,
    "move:Sludge Bomb": 533,
    "move:Sludge Wave": 534,
    "move:Smack Down": 535,
    "move:Smart Strike": 536,
    "move:Smog": 537,
    "move:Smokescreen": 538,
    "move:Snarl": 539,
    "move:Snipe Shot": 540,
    "move:Snowscape": 541,
    "move:Soak": 542,
    "move:Soft-Boiled": 543,
    "move:Solar Beam": 544,
    "move:Solar Blade": 545,
    "move:Spacial Rend": 546,
    "move:Spark": 547,
    "move:Sparkling Aria": 548,
    "move:Speed Swap": 549,
    "move:Spicy Extract": 550,
    "move:Spikes": 551,
    "move:Spiky Shield": 552,
    "move:Spin Out": 553,
    "move:Spirit Break": 554,
    "move:Spirit Shackle": 555,
    "move:Spit Up": 556,
    "move:Spite": 557,
    "move:Splash": 558,
    "move:Spore": 559,
    "move:Springtide Storm": 560,
    "move:Stealth Rock": 561,
    "move:Steel Beam": 562,
    "move:Steel Roller": 563,
    "move:Steel Wing": 564,
    "move:Sticky Web": 565,
    "move:Stockpile": 566,
    "move:Stomp": 567,
    "move:Stomping Tantrum": 568,
    "move:Stone Axe": 569,
    "move:Stone Edge": 570,
    "move:Stored Power": 571,
    "move:Strange Steam": 572,
    "move:Strength": 573,
    "move:Strength Sap": 574,
    "move:String Shot": 575,
    "move:Struggle": 576,
    "move:Struggle Bug": 577,
    "move:Stuff Cheeks": 578,
    "move:Stun Spore": 579,
    "move:Substitute": 580,
    "move:Sucker Punch": 581,
    "move:Sunny Day": 582,
    "move:Sunsteel Strike": 583,
    "move:Super Fang": 584,
    "move:Supercell Slam": 585,
    "move:Superpower": 586,
    "move:Supersonic": 587,
    "move:Surf": 588,
    "move:Surging Strikes": 589,
    "move:Swagger": 590,
    "move:Sweet Kiss": 591,
    "move:Sweet Scent": 592,
    "move:Swift": 593,
    "move:Switcheroo": 594,
    "move:Swords Dance": 595,
    "move:Synthesis": 596,
    "move:Syrup Bomb": 597,
    "move:Tachyon Cutter": 598,
    "move:Tackle": 599,
    "move:Tail Glow": 600,
    "move:Tail Slap": 601,
    "move:Tail Whip": 602,
    "move:Tailwind": 603,
    "move:Take Down": 604,
    "move:Take Heart": 605,
    "move:Tar Shot": 606,
    "move:Taunt": 607,
    "move:Tearful Look": 608,
    "move:Teatime": 609,
    "move:Teeter Dance": 610,
    "move:Teleport": 611,
    "move:Temper Flare": 612,
    "move:Tera Blast": 613,
    "move:Tera Starstorm": 614,
    "move:Terrain Pulse": 615,
    "move:Thief": 616,
    "move:Thrash": 617,
    "move:Throat Chop": 618,
    "move:Thunder": 619,
    "move:Thunder Cage": 620,
    "move:Thunder Fang": 621,
    "move:Thunder Punch": 622,
    "move:Thunder Shock": 623,
    "move:Thunder Wave": 624,
    "move:Thunderbolt": 625,
    "move:Thunderclap": 626,
    "move:Thunderous Kick": 627,
    "move:Tickle": 628,
    "move:Tidy Up": 629,
    "move:Topsy-Turvy": 630,
    "move:Torch Song": 631,
    "move:Torment": 632,
    "move:Toxic": 633,
    "move:Toxic Spikes": 634,
    "move:Toxic Thread": 635,
    "move:Trailblaze": 636,
    "move:Transform": 637,
    "move:Tri Attack": 638,
    "move:Trick": 639,
    "move:Trick Room": 640,
    "move:Triple Arrows": 641,
    "move:Triple Axel": 642,
    "move:Triple Dive": 643,
    "move:Triple Kick": 644,
    "move:Trop Kick": 645,
    "move:Twin Beam": 646,
    "move:Twister": 647,
    "move:U-turn": 648,
    "move:Upper Hand": 649,
    "move:Uproar": 650,
    "move:Vacuum Wave": 651,
    "move:Venoshock": 652,
    "move:Victory Dance": 653,
    "move:Vine Whip": 654,
    "move:Volt Switch": 655,
    "move:Volt Tackle": 656,
    "move:Wake-Up Slap": 657,
    "move:Water Gun": 658,
    "move:Water Pledge": 659,
    "move:Water Pulse": 660,
    "move:Water Shuriken": 661,
    "move:Water Spout": 662,
    "move:Waterfall": 663,
    "move:Wave Crash": 664,
    "move:Weather Ball": 665,
    "move:Whirlpool": 666,
    "move:Whirlwind": 667,
    "move:Wicked Blow": 668,
    "move:Wide Guard": 669,
    "move:Wild Charge": 670,
    "move:Wildbolt Storm": 671,
    "move:Will-O-Wisp": 672,
    "move:Wing Attack": 673,
    "move:Wish": 674,
    "move:Withdraw": 675,
    "move:Wonder Room": 676,
    "move:Wood Hammer": 677,
    "move:Work Up": 678,
    "move:Worry Seed": 679,
    "move:Wrap": 680,
    "move:X-Scissor": 681,
    "move:Yawn": 682,
    "move:Zap Cannon": 683,
    "move:Zen Headbutt": 684,
    "move:Zing Zap": 685,
    "switch:Abomasnow": 686,
    "switch:Aipom": 687,
    "switch:Alcremie": 688,
    "switch:Alcremie-Caramel-Swirl": 689,
    "switch:Alcremie-Lemon-Cream": 690,
    "switch:Alcremie-Matcha-Cream": 691,
    "switch:Alcremie-Mint-Cream": 692,
    "switch:Alcremie-Rainbow-Swirl": 693,
    "switch:Alcremie-Ruby-Cream": 694,
    "switch:Alcremie-Ruby-Swirl": 695,
    "switch:Alcremie-Salted-Cream": 696,
    "switch:Alomomola": 697,
    "switch:Altaria": 698,
    "switch:Ambipom": 699,
    "switch:Amoonguss": 700,
    "switch:Ampharos": 701,
    "switch:Annihilape": 702,
    "switch:Appletun": 703,
    "switch:Araquanid": 704,
    "switch:Arbok": 705,
    "switch:Arboliva": 706,
    "switch:Arcanine": 707,
    "switch:Arcanine-Hisui": 708,
    "switch:Arceus-Fairy": 709,
    "switch:Archaludon": 710,
    "switch:Archeops": 711,
    "switch:Arctibax": 712,
    "switch:Arctozolt": 713,
    "switch:Ariados": 714,
    "switch:Armaldo": 715,
    "switch:Armarouge": 716,
    "switch:Articuno": 717,
    "switch:Articuno-Galar": 718,
    "switch:Avalugg": 719,
    "switch:Avalugg-Hisui": 720,
    "switch:Axew": 721,
    "switch:Azelf": 722,
    "switch:Azumarill": 723,
    "switch:Azurill": 724,
    "switch:Bagon": 725,
    "switch:Banette": 726,
    "switch:Barraskewda": 727,
    "switch:Basculegion": 728,
    "switch:Basculegion-F": 729,
    "switch:Basculin": 730,
    "switch:Basculin-Blue-Striped": 731,
    "switch:Basculin-White-Striped": 732,
    "switch:Bastiodon": 733,
    "switch:Baxcalibur": 734,
    "switch:Bayleef": 735,
    "switch:Beartic": 736,
    "switch:Bellibolt": 737,
    "switch:Bellossom": 738,
    "switch:Bergmite": 739,
    "switch:Bisharp": 740,
    "switch:Blastoise": 741,
    "switch:Blaziken": 742,
    "switch:Blissey": 743,
    "switch:Blitzle": 744,
    "switch:Bombirdier": 745,
    "switch:Bonsly": 746,
    "switch:Braixen": 747,
    "switch:Brambleghast": 748,
    "switch:Braviary": 749,
    "switch:Braviary-Hisui": 750,
    "switch:Breloom": 751,
    "switch:Brionne": 752,
    "switch:Bronzong": 753,
    "switch:Bronzor": 754,
    "switch:Brute Bonnet": 755,
    "switch:Bruxish": 756,
    "switch:Buizel": 757,
    "switch:Bulbasaur": 758,
    "switch:Cacnea": 759,
    "switch:Cacturne": 760,
    "switch:Calyrex": 761,
    "switch:Calyrex-Ice": 762,
    "switch:Calyrex-Shadow": 763,
    "switch:Camerupt": 764,
    "switch:Carbink": 765,
    "switch:Carkol": 766,
    "switch:Castform": 767,
    "switch:Ceruledge": 768,
    "switch:Cetitan": 769,
    "switch:Cetoddle": 770,
    "switch:Chandelure": 771,
    "switch:Chansey": 772,
    "switch:Charizard": 773,
    "switch:Charjabug": 774,
    "switch:Charmander": 775,
    "switch:Chesnaught": 776,
    "switch:Chespin": 777,
    "switch:Chi-Yu": 778,
    "switch:Chien-Pao": 779,
    "switch:Chikorita": 780,
    "switch:Chimecho": 781,
    "switch:Chinchou": 782,
    "switch:Cinccino": 783,
    "switch:Cinderace": 784,
    "switch:Clauncher": 785,
    "switch:Clawitzer": 786,
    "switch:Clefable": 787,
    "switch:Clefairy": 788,
    "switch:Cleffa": 789,
    "switch:Clodsire": 790,
    "switch:Cloyster": 791,
    "switch:Coalossal": 792,
    "switch:Cobalion": 793,
    "switch:Cofagrigus": 794,
    "switch:Combee": 795,
    "switch:Combusken": 796,
    "switch:Comfey": 797,
    "switch:Conkeldurr": 798,
    "switch:Copperajah": 799,
    "switch:Corphish": 800,
    "switch:Corviknight": 801,
    "switch:Corvisquire": 802,
    "switch:Cosmoem": 803,
    "switch:Cosmog": 804,
    "switch:Cottonee": 805,
    "switch:Crabominable": 806,
    "switch:Crabrawler": 807,
    "switch:Cramorant": 808,
    "switch:Cranidos": 809,
    "switch:Crawdaunt": 810,
    "switch:Cresselia": 811,
    "switch:Croagunk": 812,
    "switch:Croconaw": 813,
    "switch:Cryogonal": 814,
    "switch:Cubchoo": 815,
    "switch:Cufant": 816,
    "switch:Cyclizar": 817,
    "switch:Cyndaquil": 818,
    "switch:Dachsbun": 819,
    "switch:Decidueye": 820,
    "switch:Decidueye-Hisui": 821,
    "switch:Dedenne": 822,
    "switch:Delibird": 823,
    "switch:Delphox": 824,
    "switch:Deoxys-Attack": 825,
    "switch:Dewgong": 826,
    "switch:Dewpider": 827,
    "switch:Dialga": 828,
    "switch:Dialga-Origin": 829,
    "switch:Diancie": 830,
    "switch:Diglett": 831,
    "switch:Diglett-Alola": 832,
    "switch:Dipplin": 833,
    "switch:Ditto": 834,
    "switch:Dodrio": 835,
    "switch:Doduo": 836,
    "switch:Dondozo": 837,
    "switch:Donphan": 838,
    "switch:Dragalge": 839,
    "switch:Dragapult": 840,
    "switch:Dragonair": 841,
    "switch:Dragonite": 842,
    "switch:Drakloak": 843,
    "switch:Dratini": 844,
    "switch:Drednaw": 845,
    "switch:Dreepy": 846,
    "switch:Drifblim": 847,
    "switch:Drifloon": 848,
    "switch:Drilbur": 849,
    "switch:Drowzee": 850,
    "switch:Dudunsparce": 851,
    "switch:Dudunsparce-Three-Segment": 852,
    "switch:Dugtrio": 853,
    "switch:Dugtrio-Alola": 854,
    "switch:Dunsparce": 855,
    "switch:Duosion": 856,
    "switch:Duraludon": 857,
    "switch:Dusclops": 858,
    "switch:Dusknoir": 859,
    "switch:Duskull": 860,
    "switch:Eelektrik": 861,
    "switch:Eelektross": 862,
    "switch:Eevee": 863,
    "switch:Eiscue": 864,
    "switch:Eiscue-Noice": 865,
    "switch:Electabuzz": 866,
    "switch:Electivire": 867,
    "switch:Electrode": 868,
    "switch:Electrode-Hisui": 869,
    "switch:Elekid": 870,
    "switch:Emboar": 871,
    "switch:Emolga": 872,
    "switch:Empoleon": 873,
    "switch:Enamorus": 874,
    "switch:Enamorus-Therian": 875,
    "switch:Entei": 876,
    "switch:Escavalier": 877,
    "switch:Espathra": 878,
    "switch:Espeon": 879,
    "switch:Espurr": 880,
    "switch:Eternatus": 881,
    "switch:Excadrill": 882,
    "switch:Exeggutor": 883,
    "switch:Exeggutor-Alola": 884,
    "switch:Falinks": 885,
    "switch:Farigiraf": 886,
    "switch:Feebas": 887,
    "switch:Feraligatr": 888,
    "switch:Fezandipiti": 889,
    "switch:Fidough": 890,
    "switch:Finneon": 891,
    "switch:Flaaffy": 892,
    "switch:Flamigo": 893,
    "switch:Flapple": 894,
    "switch:Flareon": 895,
    "switch:Fletchinder": 896,
    "switch:Fletchling": 897,
    "switch:Floatzel": 898,
    "switch:Florges": 899,
    "switch:Florges-Blue": 900,
    "switch:Florges-Orange": 901,
    "switch:Florges-White": 902,
    "switch:Florges-Yellow": 903,
    "switch:Flutter Mane": 904,
    "switch:Flygon": 905,
    "switch:Foongus": 906,
    "switch:Forretress": 907,
    "switch:Fraxure": 908,
    "switch:Froakie": 909,
    "switch:Froslass": 910,
    "switch:Frosmoth": 911,
    "switch:Furret": 912,
    "switch:Gabite": 913,
    "switch:Gallade": 914,
    "switch:Galvantula": 915,
    "switch:Garchomp": 916,
    "switch:Gardevoir": 917,
    "switch:Garganacl": 918,
    "switch:Gastly": 919,
    "switch:Gastrodon": 920,
    "switch:Gastrodon-East": 921,
    "switch:Gengar": 922,
    "switch:Gengar-Mega": 923,
    "switch:Gholdengo": 924,
    "switch:Gimmighoul-Roaming": 925,
    "switch:Girafarig": 926,
    "switch:Giratina": 927,
    "switch:Giratina-Origin": 928,
    "switch:Glaceon": 929,
    "switch:Glalie": 930,
    "switch:Glastrier": 931,
    "switch:Gligar": 932,
    "switch:Glimmet": 933,
    "switch:Glimmora": 934,
    "switch:Gliscor": 935,
    "switch:Gloom": 936,
    "switch:Gogoat": 937,
    "switch:Golduck": 938,
    "switch:Golem": 939,
    "switch:Golem-Alola": 940,
    "switch:Golett": 941,
    "switch:Golurk": 942,
    "switch:Goodra": 943,
    "switch:Goodra-Hisui": 944,
    "switch:Goomy": 945,
    "switch:Gorebyss": 946,
    "switch:Gothita": 947,
    "switch:Gothitelle": 948,
    "switch:Gothorita": 949,
    "switch:Gouging Fire": 950,
    "switch:Grafaiai": 951,
    "switch:Granbull": 952,
    "switch:Grapploct": 953,
    "switch:Graveler-Alola": 954,
    "switch:Great Tusk": 955,
    "switch:Greedent": 956,
    "switch:Greninja": 957,
    "switch:Grimer-Alola": 958,
    "switch:Grimmsnarl": 959,
    "switch:Grookey": 960,
    "switch:Grotle": 961,
    "switch:Groudon": 962,
    "switch:Growlithe": 963,
    "switch:Growlithe-Hisui": 964,
    "switch:Grumpig": 965,
    "switch:Gumshoos": 966,
    "switch:Gurdurr": 967,
    "switch:Gyarados": 968,
    "switch:Hakamo-o": 969,
    "switch:Happiny": 970,
    "switch:Hariyama": 971,
    "switch:Hatterene": 972,
    "switch:Hattrem": 973,
    "switch:Haunter": 974,
    "switch:Hawlucha": 975,
    "switch:Haxorus": 976,
    "switch:Heatran": 977,
    "switch:Heliolisk": 978,
    "switch:Heracross": 979,
    "switch:Hippopotas": 980,
    "switch:Hippowdon": 981,
    "switch:Hitmonchan": 982,
    "switch:Hitmonlee": 983,
    "switch:Hitmontop": 984,
    "switch:Ho-Oh": 985,
    "switch:Honchkrow": 986,
    "switch:Hoopa-Unbound": 987,
    "switch:Hoppip": 988,
    "switch:Horsea": 989,
    "switch:Houndoom": 990,
    "switch:Houndour": 991,
    "switch:Houndstone": 992,
    "switch:Hydrapple": 993,
    "switch:Hydreigon": 994,
    "switch:Hypno": 995,
    "switch:Igglybuff": 996,
    "switch:Illumise": 997,
    "switch:Impidimp": 998,
    "switch:Incineroar": 999,
    "switch:Indeedee": 1000,
    "switch:Indeedee-F": 1001,
    "switch:Infernape": 1002,
    "switch:Inkay": 1003,
    "switch:Inteleon": 1004,
    "switch:Iron Boulder": 1005,
    "switch:Iron Bundle": 1006,
    "switch:Iron Crown": 1007,
    "switch:Iron Hands": 1008,
    "switch:Iron Jugulis": 1009,
    "switch:Iron Leaves": 1010,
    "switch:Iron Moth": 1011,
    "switch:Iron Thorns": 1012,
    "switch:Iron Treads": 1013,
    "switch:Iron Valiant": 1014,
    "switch:Ivysaur": 1015,
    "switch:Jigglypuff": 1016,
    "switch:Jolteon": 1017,
    "switch:Joltik": 1018,
    "switch:Jumpluff": 1019,
    "switch:Kecleon": 1020,
    "switch:Kilowattrel": 1021,
    "switch:Kingambit": 1022,
    "switch:Kingdra": 1023,
    "switch:Kirlia": 1024,
    "switch:Klawf": 1025,
    "switch:Kleavor": 1026,
    "switch:Klefki": 1027,
    "switch:Koffing": 1028,
    "switch:Komala": 1029,
    "switch:Kommo-o": 1030,
    "switch:Koraidon": 1031,
    "switch:Kricketot": 1032,
    "switch:Kricketune": 1033,
    "switch:Krokorok": 1034,
    "switch:Krookodile": 1035,
    "switch:Kubfu": 1036,
    "switch:Kyogre": 1037,
    "switch:Kyurem": 1038,
    "switch:Kyurem-Black": 1039,
    "switch:Kyurem-White": 1040,
    "switch:Landorus": 1041,
    "switch:Landorus-Therian": 1042,
    "switch:Lanturn": 1043,
    "switch:Lapras": 1044,
    "switch:Larvesta": 1045,
    "switch:Larvitar": 1046,
    "switch:Latias": 1047,
    "switch:Latios": 1048,
    "switch:Leafeon": 1049,
    "switch:Leavanny": 1050,
    "switch:Lechonk": 1051,
    "switch:Lilligant": 1052,
    "switch:Lilligant-Hisui": 1053,
    "switch:Litleo": 1054,
    "switch:Litten": 1055,
    "switch:Lokix": 1056,
    "switch:Lombre": 1057,
    "switch:Lucario": 1058,
    "switch:Ludicolo": 1059,
    "switch:Lugia": 1060,
    "switch:Lumineon": 1061,
    "switch:Lunala": 1062,
    "switch:Lunatone": 1063,
    "switch:Lurantis": 1064,
    "switch:Luvdisc": 1065,
    "switch:Luxio": 1066,
    "switch:Luxray": 1067,
    "switch:Lycanroc": 1068,
    "switch:Lycanroc-Dusk": 1069,
    "switch:Lycanroc-Midnight": 1070,
    "switch:Mabosstiff": 1071,
    "switch:Magby": 1072,
    "switch:Magcargo": 1073,
    "switch:Magikarp": 1074,
    "switch:Magmar": 1075,
    "switch:Magmortar": 1076,
    "switch:Magnemite": 1077,
    "switch:Magneton": 1078,
    "switch:Magnezone": 1079,
    "switch:Makuhita": 1080,
    "switch:Malamar": 1081,
    "switch:Mamoswine": 1082,
    "switch:Mandibuzz": 1083,
    "switch:Mareanie": 1084,
    "switch:Mareep": 1085,
    "switch:Marill": 1086,
    "switch:Marshtomp": 1087,
    "switch:Maschiff": 1088,
    "switch:Masquerain": 1089,
    "switch:Maushold": 1090,
    "switch:Maushold-Four": 1091,
    "switch:Medicham": 1092,
    "switch:Meditite": 1093,
    "switch:Meganium": 1094,
    "switch:Meowscarada": 1095,
    "switch:Meowstic": 1096,
    "switch:Meowstic-F": 1097,
    "switch:Meowth": 1098,
    "switch:Meowth-Alola": 1099,
