{
  "species": {
    "<pad>": 0,
    "<unknown>": 1,
    "Abomasnow": 2,
    "Accelgor": 3,
    "Aegislash": 4,
    "Aegislash-Blade": 5,
    "Aerodactyl": 6,
    "Aggron": 7,
    "Aipom": 8,
    "Alakazam": 9,
    "Alakazam-Mega": 10,
    "Alcremie": 11,
    "Alcremie-Caramel-Swirl": 12,
    "Alcremie-Lemon-Cream": 13,
    "Alcremie-Matcha-Cream": 14,
    "Alcremie-Mint-Cream": 15,
    "Alcremie-Rainbow-Swirl": 16,
    "Alcremie-Ruby-Cream": 17,
    "Alcremie-Ruby-Swirl": 18,
    "Alcremie-Salted-Cream": 19,
    "Alomomola": 20,
    "Altaria": 21,
    "Altaria-Mega": 22,
    "Ambipom": 23,
    "Amoonguss": 24,
    "Ampharos": 25,
    "Annihilape": 26,
    "Appletun": 27,
    "Applin": 28,
    "Araquanid": 29,
    "Arbok": 30,
    "Arboliva": 31,
    "Arcanine": 32,
    "Arcanine-Hisui": 33,
    "Arceus-Fairy": 34,
    "Arceus-Water": 35,
    "Archaludon": 36,
    "Archeops": 37,
    "Arctibax": 38,
    "Arctozolt": 39,
    "Ariados": 40,
    "Armaldo": 41,
    "Armarouge": 42,
    "Articuno": 43,
    "Articuno-Galar": 44,
    "Audino": 45,
    "Audino-Mega": 46,
    "Aurorus": 47,
    "Avalugg": 48,
    "Avalugg-Hisui": 49,
    "Axew": 50,
    "Azelf": 51,
    "Azumarill": 52,
    "Azurill": 53,
    "Bagon": 54,
    "Banette": 55,
    "Banette-Mega": 56,
    "Barboach": 57,
    "Barraskewda": 58,
    "Basculegion": 59,
    "Basculegion-F": 60,
    "Basculin": 61,
    "Basculin-Blue-Striped": 62,
    "Basculin-White-Striped": 63,
    "Bastiodon": 64,
    "Baxcalibur": 65,
    "Bayleef": 66,
    "Beartic": 67,
    "Beedrill": 68,
    "Beedrill-Mega": 69,
    "Bellibolt": 70,
    "Bellossom": 71,
    "Bellsprout": 72,
    "Bergmite": 73,
    "Bewear": 74,
    "Bibarel": 75,
    "Bisharp": 76,
    "Blastoise": 77,
    "Blastoise-Mega": 78,
    "Blaziken": 79,
    "Blissey": 80,
    "Blitzle": 81,
    "Bombirdier": 82,
    "Bonsly": 83,
    "Bounsweet": 84,
    "Braixen": 85,
    "Brambleghast": 86,
    "Braviary": 87,
    "Braviary-Hisui": 88,
    "Breloom": 89,
    "Brionne": 90,
    "Bronzong": 91,
    "Bronzor": 92,
    "Brute Bonnet": 93,
    "Bruxish": 94,
    "Buizel": 95,
    "Bulbasaur": 96,
    "Cacnea": 97,
    "Cacturne": 98,
    "Calyrex": 99,
    "Calyrex-Ice": 100,
    "Calyrex-Shadow": 101,
    "Camerupt": 102,
    "Camerupt-Mega": 103,
    "Capsakid": 104,
    "Carbink": 105,
    "Carkol": 106,
    "Carnivine": 107,
    "Carracosta": 108,
    "Castform": 109,
    "Castform-Rainy": 110,
    "Castform-Sunny": 111,
    "Celebi": 112,
    "Centiskorch": 113,
    "Ceruledge": 114,
    "Cetitan": 115,
    "Cetoddle": 116,
    "Chandelure": 117,
    "Chansey": 118,
    "Charizard": 119,
    "Charizard-Mega-Y": 120,
    "Charjabug": 121,
    "Charmander": 122,
    "Charmeleon": 123,
    "Cherrim": 124,
    "Cherrim-Sunshine": 125,
    "Chesnaught": 126,
    "Chespin": 127,
    "Chewtle": 128,
    "Chi-Yu": 129,
    "Chien-Pao": 130,
    "Chikorita": 131,
    "Chimecho": 132,
    "Chinchou": 133,
    "Chingling": 134,
    "Cinccino": 135,
    "Cinderace": 136,
    "Clauncher": 137,
    "Clawitzer": 138,
    "Claydol": 139,
    "Clefable": 140,
    "Clefairy": 141,
    "Cleffa": 142,
    "Clodsire": 143,
    "Cloyster": 144,
    "Coalossal": 145,
    "Cobalion": 146,
    "Cofagrigus": 147,
    "Combee": 148,
    "Combusken": 149,
    "Comfey": 150,
    "Conkeldurr": 151,
    "Copperajah": 152,
    "Corphish": 153,
    "Corviknight": 154,
    "Corvisquire": 155,
    "Cosmoem": 156,
    "Cosmog": 157,
    "Cottonee": 158,
    "Crabominable": 159,
    "Crabrawler": 160,
    "Cradily": 161,
    "Cramorant": 162,
    "Cramorant-Gorging": 163,
    "Cramorant-Gulping": 164,
    "Cranidos": 165,
    "Crawdaunt": 166,
    "Cresselia": 167,
    "Croagunk": 168,
    "Crocalor": 169,
    "Croconaw": 170,
    "Crustle": 171,
    "Cryogonal": 172,
    "Cubchoo": 173,
    "Cufant": 174,
    "Cursola": 175,
    "Cutiefly": 176,
    "Cyclizar": 177,
    "Cyndaquil": 178,
    "Dachsbun": 179,
    "Darmanitan-Galar": 180,
    "Dartrix": 181,
    "Decidueye": 182,
    "Decidueye-Hisui": 183,
    "Dedenne": 184,
    "Deino": 185,
    "Delibird": 186,
    "Delphox": 187,
    "Deoxys-Attack": 188,
    "Dewgong": 189,
    "Dewpider": 190,
    "Dhelmise": 191,
    "Dialga": 192,
    "Dialga-Origin": 193,
    "Diancie": 194,
    "Diglett": 195,
    "Diglett-Alola": 196,
    "Dipplin": 197,
    "Ditto": 198,
    "Dodrio": 199,
    "Doduo": 200,
    "Dolliv": 201,
    "Dondozo": 202,
    "Donphan": 203,
    "Doublade": 204,
    "Dracozolt": 205,
    "Dragalge": 206,
    "Dragapult": 207,
    "Dragonair": 208,
    "Dragonite": 209,
    "Drakloak": 210,
    "Dratini": 211,
    "Drednaw": 212,
    "Dreepy": 213,
    "Drifblim": 214,
    "Drifloon": 215,
    "Drilbur": 216,
    "Drizzile": 217,
    "Drowzee": 218,
    "Ducklett": 219,
    "Dudunsparce": 220,
    "Dudunsparce-*": 221,
    "Dudunsparce-Three-Segment": 222,
    "Dugtrio": 223,
    "Dugtrio-Alola": 224,
    "Dunsparce": 225,
    "Duosion": 226,
    "Duraludon": 227,
    "Dusclops": 228,
    "Dusknoir": 229,
    "Duskull": 230,
    "Eelektrik": 231,
    "Eelektross": 232,
    "Eevee": 233,
    "Eiscue": 234,
    "Eiscue-Noice": 235,
    "Electabuzz": 236,
    "Electivire": 237,
    "Electrode": 238,
    "Electrode-Hisui": 239,
    "Elekid": 240,
    "Emboar": 241,
    "Emolga": 242,
    "Empoleon": 243,
    "Enamorus": 244,
    "Enamorus-Therian": 245,
    "Entei": 246,
    "Escavalier": 247,
    "Espathra": 248,
    "Espeon": 249,
    "Espurr": 250,
    "Eternatus": 251,
    "Excadrill": 252,
    "Exeggcute": 253,
    "Exeggutor": 254,
    "Exeggutor-Alola": 255,
    "Falinks": 256,
    "Farigiraf": 257,
    "Feebas": 258,
    "Fennekin": 259,
    "Feraligatr": 260,
    "Fezandipiti": 261,
    "Fidough": 262,
    "Finneon": 263,
    "Flaaffy": 264,
    "Flabe\u0301be\u0301": 265,
    "Flamigo": 266,
    "Flapple": 267,
    "Flareon": 268,
    "Fletchinder": 269,
    "Fletchling": 270,
    "Flittle": 271,
    "Floatzel": 272,
    "Floette": 273,
    "Floette-White": 274,
    "Floette-Yellow": 275,
    "Floragato": 276,
    "Florges": 277,
    "Florges-Blue": 278,
    "Florges-Orange": 279,
    "Florges-White": 280,
    "Florges-Yellow": 281,
    "Flutter Mane": 282,
    "Flygon": 283,
    "Fomantis": 284,
    "Foongus": 285,
    "Forretress": 286,
    "Fraxure": 287,
    "Froakie": 288,
    "Frogadier": 289,
    "Froslass": 290,
    "Frosmoth": 291,
    "Fuecoco": 292,
    "Furret": 293,
    "Gabite": 294,
    "Gallade": 295,
    "Gallade-Mega": 296,
    "Galvantula": 297,
    "Garchomp": 298,
    "Gardevoir": 299,
    "Gardevoir-Mega": 300,
    "Garganacl": 301,
    "Gastly": 302,
    "Gastrodon": 303,
    "Gastrodon-East": 304,
    "Gengar": 305,
    "Gengar-Mega": 306,
    "Geodude": 307,
    "Geodude-Alola": 308,
    "Gholdengo": 309,
    "Gible": 310,
    "Gigalith": 311,
    "Gimmighoul": 312,
    "Gimmighoul-Roaming": 313,
    "Girafarig": 314,
    "Giratina": 315,
    "Giratina-Origin": 316,
    "Glaceon": 317,
    "Glalie": 318,
    "Glastrier": 319,
    "Gligar": 320,
    "Glimmet": 321,
    "Glimmora": 322,
    "Gliscor": 323,
    "Gloom": 324,
    "Gogoat": 325,
    "Golduck": 326,
    "Golem": 327,
    "Golem-Alola": 328,
    "Golett": 329,
    "Golurk": 330,
    "Goodra": 331,
    "Goodra-Hisui": 332,
    "Goomy": 333,
    "Gorebyss": 334,
    "Gothita": 335,
    "Gothitelle": 336,
    "Gothorita": 337,
    "Gouging Fire": 338,
    "Gourgeist-*": 339,
    "Gourgeist-Large": 340,
    "Grafaiai": 341,
    "Granbull": 342,
    "Grapploct": 343,
    "Graveler": 344,
    "Graveler-Alola": 345,
    "Great Tusk": 346,
    "Greavard": 347,
    "Greedent": 348,
    "Greninja": 349,
    "Greninja-*": 350,
    "Grimer-Alola": 351,
    "Grimmsnarl": 352,
    "Grookey": 353,
    "Grotle": 354,
    "Groudon": 355,
    "Groudon-Primal": 356,
    "Grovyle": 357,
    "Growlithe": 358,
    "Growlithe-Hisui": 359,
    "Grumpig": 360,
    "Gulpin": 361,
    "Gumshoos": 362,
    "Gurdurr": 363,
    "Gyarados": 364,
    "Hakamo-o": 365,
    "Happiny": 366,
    "Hariyama": 367,
    "Hatterene": 368,
    "Hattrem": 369,
    "Haunter": 370,
    "Hawlucha": 371,
    "Haxorus": 372,
    "Heatmor": 373,
    "Heatran": 374,
    "Heliolisk": 375,
    "Heracross": 376,
    "Hippopotas": 377,
    "Hippowdon": 378,
    "Hitmonchan": 379,
    "Hitmonlee": 380,
    "Hitmontop": 381,
    "Ho-Oh": 382,
    "Honchkrow": 383,
    "Hoopa-Unbound": 384,
    "Hoothoot": 385,
    "Hoppip": 386,
    "Horsea": 387,
    "Houndoom": 388,
    "Houndoom-Mega": 389,
    "Houndour": 390,
    "Houndstone": 391,
    "Hydrapple": 392,
    "Hydreigon": 393,
    "Hypno": 394,
    "Igglybuff": 395,
    "Illumise": 396,
    "Impidimp": 397,
    "Incineroar": 398,
    "Indeedee": 399,
    "Indeedee-F": 400,
    "Infernape": 401,
    "Inkay": 402,
    "Inteleon": 403,
    "Iron Boulder": 404,
    "Iron Bundle": 405,
    "Iron Crown": 406,
    "Iron Hands": 407,
    "Iron Jugulis": 408,
    "Iron Leaves": 409,
    "Iron Moth": 410,
    "Iron Thorns": 411,
    "Iron Treads": 412,
    "Iron Valiant": 413,
    "Ivysaur": 414,
    "Jellicent": 415,
    "Jigglypuff": 416,
    "Jirachi": 417,
    "Jolteon": 418,
    "Joltik": 419,
    "Jumpluff": 420,
    "Jynx": 421,
    "Kabutops": 422,
    "Kangaskhan": 423,
    "Kangaskhan-Mega": 424,
    "Kecleon": 425,
    "Kilowattrel": 426,
    "Kingambit": 427,
    "Kingdra": 428,
    "Kingler": 429,
    "Kirlia": 430,
    "Klawf": 431,
    "Kleavor": 432,
    "Klefki": 433,
    "Klinklang": 434,
    "Koffing": 435,
    "Komala": 436,
    "Kommo-o": 437,
    "Koraidon": 438,
    "Kricketot": 439,
    "Kricketune": 440,
    "Krokorok": 441,
    "Krookodile": 442,
    "Kubfu": 443,
    "Kyogre": 444,
    "Kyogre-Primal": 445,
    "Kyurem": 446,
    "Kyurem-Black": 447,
    "Kyurem-White": 448,
    "Lampent": 449,
    "Landorus": 450,
    "Landorus-Therian": 451,
    "Lanturn": 452,
    "Lapras": 453,
    "Larvesta": 454,
    "Larvitar": 455,
    "Latias": 456,
    "Latios": 457,
    "Leafeon": 458,
    "Leavanny": 459,
    "Lechonk": 460,
    "Liepard": 461,
    "Lilligant": 462,
    "Lilligant-Hisui": 463,
    "Linoone": 464,
    "Litleo": 465,
    "Litten": 466,
    "Litwick": 467,
    "Lokix": 468,
    "Lombre": 469,
    "Lotad": 470,
    "Lucario": 471,
    "Ludicolo": 472,
    "Lugia": 473,
    "Lumineon": 474,
    "Lunala": 475,
    "Lunatone": 476,
    "Lurantis": 477,
    "Luvdisc": 478,
    "Luxio": 479,
    "Luxray": 480,
    "Lycanroc": 481,
    "Lycanroc-Dusk": 482,
    "Lycanroc-Midnight": 483,
    "Mabosstiff": 484,
    "Magby": 485,
    "Magcargo": 486,
    "Magearna": 487,
    "Magikarp": 488,
    "Magmar": 489,
    "Magmortar": 490,
    "Magnemite": 491,
    "Magneton": 492,
    "Magnezone": 493,
    "Makuhita": 494,
    "Malamar": 495,
    "Mamoswine": 496,
    "Mandibuzz": 497,
    "Manectric": 498,
    "Manectric-Mega": 499,
    "Mankey": 500,
    "Mantine": 501,
    "Mareanie": 502,
    "Mareep": 503,
    "Marill": 504,
    "Marowak": 505,
    "Marshtomp": 506,
    "Maschiff": 507,
    "Masquerain": 508,
    "Maushold": 509,
    "Maushold-Four": 510,
    "Medicham": 511,
    "Meditite": 512,
    "Meganium": 513,
    "Melmetal": 514,
    "Meowscarada": 515,
    "Meowstic": 516,
    "Meowstic-F": 517,
    "Meowth": 518,
    "Meowth-Alola": 519,
    "Meowth-Galar": 520,
    "Mesprit": 521,
    "Metagross": 522,
    "Metagross-Mega": 523,
    "Metang": 524,
    "Mew": 525,
    "Mewtwo": 526,
    "Mewtwo-Mega-X": 527,
    "Mewtwo-Mega-Y": 528,
    "Mienfoo": 529,
    "Mienshao": 530,
    "Mightyena": 531,
    "Milotic": 532,
    "Mimikyu": 533,
    "Mimikyu-Busted": 534,
    "Minccino": 535,
    "Minior": 536,
    "Minior-Blue": 537,
    "Minior-Green": 538,
    "Minior-Indigo": 539,
    "Minior-Meteor": 540,
    "Minior-Orange": 541,
    "Minior-Violet": 542,
    "Minior-Yellow": 543,
    "Minun": 544,
    "Miraidon": 545,
    "Misdreavus": 546,
    "Mismagius": 547,
    "Moltres": 548,
    "Moltres-Galar": 549,
    "Monferno": 550,
    "Morgrem": 551,
    "Morpeko": 552,
    "Morpeko-Hangry": 553,
    "Mothim": 554,
    "Mr. Mime-Galar": 555,
    "Mudbray": 556,
    "Mudkip": 557,
    "Mudsdale": 558,
    "Muk": 559,
    "Muk-Alola": 560,
    "Munchlax": 561,
    "Munkidori": 562,
    "Murkrow": 563,
    "Nacli": 564,
    "Naclstack": 565,
    "Naganadel": 566,
    "Necrozma": 567,
    "Necrozma-Dawn-Wings": 568,
    "Necrozma-Dusk-Mane": 569,
    "Nidoking": 570,
    "Nidoqueen": 571,
    "Ninetales": 572,
    "Ninetales-Alola": 573,
    "Noctowl": 574,
    "Noivern": 575,
    "Nosepass": 576,
    "Numel": 577,
    "Nuzleaf": 578,
    "Nymble": 579,
    "Oddish": 580,
    "Ogerpon": 581,
    "Ogerpon-Cornerstone": 582,
    "Ogerpon-Cornerstone-Tera": 583,
    "Ogerpon-Hearthflame": 584,
    "Ogerpon-Hearthflame-Tera": 585,
    "Ogerpon-Teal-Tera": 586,
    "Ogerpon-Wellspring": 587,
    "Ogerpon-Wellspring-Tera": 588,
    "Oinkologne": 589,
    "Oinkologne-F": 590,
    "Okidogi": 591,
    "Oranguru": 592,
    "Orbeetle": 593,
    "Oricorio": 594,
    "Oricorio-Pa'u": 595,
    "Oricorio-Pom-Pom": 596,
    "Oricorio-Sensu": 597,
    "Orthworm": 598,
    "Oshawott": 599,
    "Overqwil": 600,
    "Pachirisu": 601,
    "Palafin": 602,
    "Palafin-Hero": 603,
    "Palkia": 604,
    "Palkia-Origin": 605,
    "Palossand": 606,
    "Pangoro": 607,
    "Passimian": 608,
    "Pawmi": 609,
    "Pawmo": 610,
    "Pawmot": 611,
    "Pawniard": 612,
    "Pecharunt": 613,
    "Pelipper": 614,
    "Perrserker": 615,
    "Persian": 616,
    "Persian-Alola": 617,
    "Phanpy": 618,
    "Phantump": 619,
    "Pichu": 620,
    "Pignite": 621,
    "Pikachu": 622,
    "Pikachu-Alola": 623,
    "Pikachu-Hoenn": 624,
    "Pikachu-Kalos": 625,
    "Pikachu-Original": 626,
    "Pikachu-Partner": 627,
    "Pikachu-Sinnoh": 628,
    "Pikachu-Unova": 629,
    "Pikachu-World": 630,
    "Piloswine": 631,
    "Pincurchin": 632,
    "Pineco": 633,
    "Piplup": 634,
    "Plusle": 635,
    "Politoed": 636,
    "Poliwag": 637,
    "Poliwhirl": 638,
    "Poliwrath": 639,
    "Poltchageist": 640,
    "Poltchageist-Artisan": 641,
    "Polteageist": 642,
    "Polteageist-Antique": 643,
    "Poochyena": 644,
    "Popplio": 645,
    "Porygon": 646,
    "Porygon-Z": 647,
    "Porygon2": 648,
    "Primarina": 649,
    "Primeape": 650,
    "Prinplup": 651,
    "Probopass": 652,
    "Psyduck": 653,
    "Pyroar": 654,
    "Pyukumuku": 655,
    "Quagsire": 656,
    "Quaquaval": 657,
    "Quaxly": 658,
    "Quaxwell": 659,
    "Quilava": 660,
    "Quilladin": 661,
    "Qwilfish": 662,
    "Qwilfish-Hisui": 663,
    "Raboot": 664,
    "Rabsca": 665,
    "Raging Bolt": 666,
    "Raichu": 667,
    "Raichu-Alola": 668,
    "Raikou": 669,
    "Ralts": 670,
    "Rampardos": 671,
    "Rapidash-Galar": 672,
    "Raticate": 673,
    "Rayquaza": 674,
    "Regice": 675,
    "Regidrago": 676,
    "Regieleki": 677,
    "Regigigas": 678,
    "Regirock": 679,
    "Registeel": 680,
    "Reshiram": 681,
    "Reuniclus": 682,
    "Revavroom": 683,
    "Rhydon": 684,
    "Rhyhorn": 685,
    "Rhyperior": 686,
    "Ribombee": 687,
    "Rillaboom": 688,
    "Riolu": 689,
    "Roaring Moon": 690,
    "Rockruff": 691,
    "Rotom": 692,
    "Rotom-Fan": 693,
    "Rotom-Frost": 694,
    "Rotom-Heat": 695,
    "Rotom-Mow": 696,
    "Rotom-Wash": 697,
    "Rowlet": 698,
    "Rufflet": 699,
    "Sableye": 700,
    "Salamence": 701,
    "Salamence-Mega": 702,
    "Salandit": 703,
    "Salazzle": 704,
    "Samurott": 705,
    "Samurott-Hisui": 706,
    "Sandaconda": 707,
    "Sandile": 708,
    "Sandshrew": 709,
    "Sandshrew-Alola": 710,
    "Sandslash": 711,
    "Sandslash-Alola": 712,
    "Sandy Shocks": 713,
    "Sandygast": 714,
    "Sawsbuck": 715,
    "Sawsbuck-Autumn": 716,
    "Sawsbuck-Summer": 717,
    "Sawsbuck-Winter": 718,
    "Scatterbug": 719,
    "Sceptile": 720,
    "Sceptile-Mega": 721,
    "Scizor": 722,
    "Scolipede": 723,
    "Scorbunny": 724,
    "Scovillain": 725,
    "Scrafty": 726,
    "Scraggy": 727,
    "Scream Tail": 728,
    "Scyther": 729,
    "Seadra": 730,
    "Seedot": 731,
    "Seel": 732,
    "Sentret": 733,
    "Serperior": 734,
    "Servine": 735,
    "Seviper": 736,
    "Sewaddle": 737,
    "Sharpedo": 738,
    "Shaymin": 739,
    "Shedinja": 740,
    "Shelgon": 741,
    "Shellder": 742,
    "Shellos": 743,
    "Shellos-East": 744,
    "Shieldon": 745,
    "Shiftry": 746,
    "Shiinotic": 747,
    "Shinx": 748,
    "Shroodle": 749,
    "Shroomish": 750,
    "Shuppet": 751,
    "Sigilyph": 752,
    "Silicobra": 753,
    "Silvally-*": 754,
    "Silvally-Fairy": 755,
    "Sinistcha": 756,
    "Sinistcha-Masterpiece": 757,
    "Sinistea": 758,
    "Skarmory": 759,
    "Skeledirge": 760,
    "Skiddo": 761,
    "Skiploom": 762,
    "Skrelp": 763,
    "Skuntank": 764,
    "Skwovet": 765,
    "Slaking": 766,
    "Sliggoo": 767,
    "Sliggoo-Hisui": 768,
    "Slither Wing": 769,
    "Slowbro": 770,
    "Slowbro-Galar": 771,
    "Slowking": 772,
    "Slowking-Galar": 773,
    "Slowpoke": 774,
    "Slowpoke-Galar": 775,
    "Slugma": 776,
    "Smeargle": 777,
    "Sneasel": 778,
    "Sneasel-Hisui": 779,
    "Sneasler": 780,
    "Snivy": 781,
    "Snom": 782,
    "Snorlax": 783,
    "Snorunt": 784,
    "Snover": 785,
    "Snubbull": 786,
    "Sobble": 787,
    "Solgaleo": 788,
    "Solosis": 789,
    "Spectrier": 790,
    "Spewpa": 791,
    "Spidops": 792,
    "Spinarak": 793,
    "Spiritomb": 794,
    "Spoink": 795,
    "Sprigatito": 796,
    "Squawkabilly": 797,
    "Squawkabilly-Blue": 798,
    "Squawkabilly-White": 799,
    "Squawkabilly-Yellow": 800,
    "Squirtle": 801,
    "Stantler": 802,
    "Staraptor": 803,
    "Staravia": 804,
    "Starly": 805,
    "Starmie": 806,
    "Steelix": 807,
    "Steelix-Mega": 808,
    "Steenee": 809,
    "Stonjourner": 810,
    "Stunky": 811,
    "Sudowoodo": 812,
    "Suicune": 813,
    "Sunflora": 814,
    "Sunkern": 815,
    "Surskit": 816,
    "Swablu": 817,
    "Swadloon": 818,
    "Swalot": 819,
    "Swampert": 820,
    "Swampert-Mega": 821,
    "Swanna": 822,
    "Swellow": 823,
    "Swinub": 824,
    "Swoobat": 825,
    "Sylveon": 826,
    "Tadbulb": 827,
    "Talonflame": 828,
    "Tandemaus": 829,
    "Tangrowth": 830,
    "Tapu Bulu": 831,
    "Tapu Fini": 832,
    "Tapu Lele": 833,
    "Tarountula": 834,
    "Tatsugiri": 835,
    "Tatsugiri-Droopy": 836,
    "Tatsugiri-Stretchy": 837,
    "Tauros": 838,
    "Tauros-Paldea-Aqua": 839,
    "Tauros-Paldea-Blaze": 840,
    "Tauros-Paldea-Combat": 841,
    "Teddiursa": 842,
    "Tentacool": 843,
    "Tentacruel": 844,
    "Tepig": 845,
    "Terapagos": 846,
    "Terapagos-Stellar": 847,
    "Terapagos-Terastal": 848,
    "Terrakion": 849,
    "Thievul": 850,
    "Thundurus": 851,
    "Thundurus-Therian": 852,
    "Thwackey": 853,
    "Timburr": 854,
    "Ting-Lu": 855,
    "Tinkatink": 856,
    "Tinkaton": 857,
    "Tinkatuff": 858,
    "Toedscool": 859,
    "Toedscruel": 860,
    "Togedemaru": 861,
    "Togetic": 862,
    "Torchic": 863,
    "Torkoal": 864,
    "Tornadus": 865,
    "Tornadus-Therian": 866,
    "Torracat": 867,
    "Torterra": 868,
    "Totodile": 869,
    "Toucannon": 870,
    "Toxapex": 871,
    "Toxicroak": 872,
    "Toxtricity": 873,
    "Toxtricity-Low-Key": 874,
    "Trapinch": 875,
    "Treecko": 876,
    "Trevenant": 877,
    "Tropius": 878,
    "Trumbeak": 879,
    "Tsareena": 880,
    "Turtwig": 881,
    "Typhlosion": 882,
    "Typhlosion-Hisui": 883,
    "Tyranitar": 884,
    "Tyrogue": 885,
    "Umbreon": 886,
    "Ursaluna": 887,
    "Ursaluna-Bloodmoon": 888,
    "Ursaring": 889,
    "Urshifu": 890,
    "Urshifu-*": 891,
    "Urshifu-Rapid-Strike": 892,
    "Uxie": 893,
    "Vanilluxe": 894,
    "Vaporeon": 895,
    "Varoom": 896,
    "Veluza": 897,
    "Venomoth": 898,
    "Venonat": 899,
    "Venusaur": 900,
    "Venusaur-Mega": 901,
    "Vespiquen": 902,
    "Vibrava": 903,
    "Victreebel": 904,
    "Vigoroth": 905,
    "Vikavolt": 906,
    "Vileplume": 907,
    "Virizion": 908,
    "Vivillon": 909,
    "Vivillon-Archipelago": 910,
    "Vivillon-Continental": 911,
    "Vivillon-Elegant": 912,
    "Vivillon-Fancy": 913,
    "Vivillon-Garden": 914,
    "Vivillon-High Plains": 915,
    "Vivillon-Icy Snow": 916,
    "Vivillon-Jungle": 917,
    "Vivillon-Marine": 918,
    "Vivillon-Modern": 919,
    "Vivillon-Monsoon": 920,
    "Vivillon-Ocean": 921,
    "Vivillon-Pokeball": 922,
    "Vivillon-Polar": 923,
    "Vivillon-River": 924,
    "Vivillon-Savanna": 925,
    "Vivillon-Sun": 926,
    "Vivillon-Tundra": 927,
    "Volbeat": 928,
    "Volcanion": 929,
    "Volcarona": 930,
    "Voltorb": 931,
    "Voltorb-Hisui": 932,
    "Vullaby": 933,
    "Vulpix": 934,
    "Vulpix-Alola": 935,
    "Walking Wake": 936,
    "Wartortle": 937,
    "Wattrel": 938,
    "Weavile": 939,
    "Weepinbell": 940,
    "Weezing": 941,
    "Weezing-Galar": 942,
    "Whimsicott": 943,
    "Whiscash": 944,
    "Wigglytuff": 945,
    "Wiglett": 946,
    "Wingull": 947,
    "Wishiwashi": 948,
    "Wishiwashi-School": 949,
    "Wo-Chien": 950,
    "Wobbuffet": 951,
    "Wooper": 952,
    "Wooper-Paldea": 953,
    "Wugtrio": 954,
    "Wyrdeer": 955,
    "Xatu": 956,
    "Xerneas": 957,
    "Xerneas-*": 958,
    "Xurkitree": 959,
    "Yanma": 960,
    "Yanmega": 961,
    "Yungoos": 962,
    "Zacian": 963,
    "Zacian-*": 964,
    "Zacian-Crowned": 965,
    "Zamazenta": 966,
    "Zamazenta-*": 967,
    "Zamazenta-Crowned": 968,
    "Zangoose": 969,
    "Zapdos": 970,
    "Zapdos-Galar": 971,
    "Zebstrika": 972,
    "Zekrom": 973,
    "Zoroark": 974,
    "Zoroark-Hisui": 975,
    "Zorua": 976,
    "Zorua-Hisui": 977,
    "Zweilous": 978,
    "Zygarde": 979
  },
  "actions": {
    "<pad>": 0,
    "<none>": 1,
    "<cant>": 2,
    "move:Absorb": 3,
    "move:Accelerock": 4,
    "move:Acid": 5,
    "move:Acid Armor": 6,
    "move:Acid Spray": 7,
    "move:Acrobatics": 8,
    "move:Acupressure": 9,
    "move:Aerial Ace": 10,
    "move:Aeroblast": 11,
    "move:After You": 12,
    "move:Agility": 13,
    "move:Air Cutter": 14,
    "move:Air Slash": 15,
    "move:Alluring Voice": 16,
    "move:Ally Switch": 17,
    "move:Amnesia": 18,
    "move:Ancient Power": 19,
    "move:Apple Acid": 20,
    "move:Aqua Cutter": 21,
    "move:Aqua Jet": 22,
    "move:Aqua Ring": 23,
    "move:Aqua Step": 24,
    "move:Aqua Tail": 25,
    "move:Arm Thrust": 26,
    "move:Armor Cannon": 27,
    "move:Aromatic Mist": 28,
    "move:Assurance": 29,
    "move:Astonish": 30,
    "move:Astral Barrage": 31,
    "move:Attack Order": 32,
    "move:Attract": 33,
    "move:Aura Sphere": 34,
    "move:Aura Wheel": 35,
    "move:Aurora Beam": 36,
    "move:Aurora Veil": 37,
    "move:Avalanche": 38,
    "move:Axe Kick": 39,
    "move:Baby-Doll Eyes": 40,
    "move:Baneful Bunker": 41,
    "move:Barb Barrage": 42,
    "move:Baton Pass": 43,
    "move:Beak Blast": 44,
    "move:Beat Up": 45,
    "move:Behemoth Bash": 46,
    "move:Behemoth Blade": 47,
    "move:Belch": 48,
    "move:Belly Drum": 49,
    "move:Bind": 50,
    "move:Bite": 51,
    "move:Bitter Blade": 52,
    "move:Bitter Malice": 53,
    "move:Blast Burn": 54,
    "move:Blaze Kick": 55,
    "move:Bleakwind Storm": 56,
    "move:Blizzard": 57,
    "move:Block": 58,
    "move:Blood Moon": 59,
    "move:Blue Flare": 60,
    "move:Body Press": 61,
    "move:Body Slam": 62,
    "move:Bolt Beak": 63,
    "move:Bolt Strike": 64,
    "move:Bone Rush": 65,
    "move:Bonemerang": 66,
    "move:Boomburst": 67,
    "move:Bounce": 68,
    "move:Brave Bird": 69,
    "move:Breaking Swipe": 70,
    "move:Brick Break": 71,
    "move:Brine": 72,
    "move:Brutal Swing": 73,
    "move:Bubble Beam": 74,
    "move:Bug Bite": 75,
    "move:Bug Buzz": 76,
    "move:Bulk Up": 77,
    "move:Bulldoze": 78,
    "move:Bullet Punch": 79,
    "move:Bullet Seed": 80,
    "move:Burn Up": 81,
    "move:Burning Bulwark": 82,
    "move:Burning Jealousy": 83,
    "move:Calm Mind": 84,
    "move:Ceaseless Edge": 85,
    "move:Charge": 86,
    "move:Charge Beam": 87,
    "move:Charm": 88,
    "move:Chilling Water": 89,
    "move:Chilly Reception": 90,
    "move:Chloroblast": 91,
    "move:Circle Throw": 92,
    "move:Clanging Scales": 93,
    "move:Clangorous Soul": 94,
    "move:Clear Smog": 95,
    "move:Close Combat": 96,
    "move:Coaching": 97,
    "move:Coil": 98,
    "move:Collision Course": 99,
    "move:Comeuppance": 100,
    "move:Confide": 101,
    "move:Confuse Ray": 102,
    "move:Confusion": 103,
    "move:Conversion": 104,
    "move:Conversion 2": 105,
    "move:Copycat": 106,
    "move:Corrosive Gas": 107,
    "move:Cosmic Power": 108,
    "move:Cotton Guard": 109,
    "move:Cotton Spore": 110,
    "move:Counter": 111,
    "move:Court Change": 112,
    "move:Covet": 113,
    "move:Crabhammer": 114,
    "move:Cross Chop": 115,
    "move:Cross Poison": 116,
    "move:Crunch": 117,
    "move:Crush Claw": 118,
    "move:Crush Grip": 119,
    "move:Curse": 120,
    "move:Cut": 121,
    "move:Dark Pulse": 122,
    "move:Dark Void": 123,
    "move:Darkest Lariat": 124,
    "move:Dazzling Gleam": 125,
    "move:Decorate": 126,
    "move:Defend Order": 127,
    "move:Defense Curl": 128,
    "move:Defog": 129,
    "move:Destiny Bond": 130,
    "move:Detect": 131,
    "move:Diamond Storm": 132,
    "move:Dig": 133,
    "move:Dire Claw": 134,
    "move:Disable": 135,
    "move:Disarming Voice": 136,
    "move:Discharge": 137,
    "move:Dive": 138,
    "move:Doodle": 139,
    "move:Doom Desire": 140,
    "move:Double Hit": 141,
    "move:Double Kick": 142,
    "move:Double Shock": 143,
    "move:Double Team": 144,
    "move:Double-Edge": 145,
    "move:Draco Meteor": 146,
    "move:Dragon Ascent": 147,
    "move:Dragon Breath": 148,
    "move:Dragon Cheer": 149,
    "move:Dragon Claw": 150,
    "move:Dragon Dance": 151,
    "move:Dragon Darts": 152,
    "move:Dragon Energy": 153,
    "move:Dragon Hammer": 154,
    "move:Dragon Pulse": 155,
    "move:Dragon Rush": 156,
    "move:Dragon Tail": 157,
    "move:Drain Punch": 158,
    "move:Draining Kiss": 159,
    "move:Dream Eater": 160,
    "move:Drill Peck": 161,
    "move:Drill Run": 162,
    "move:Drum Beating": 163,
    "move:Dual Wingbeat": 164,
    "move:Dynamax Cannon": 165,
    "move:Dynamic Punch": 166,
    "move:Earth Power": 167,
    "move:Earthquake": 168,
    "move:Echoed Voice": 169,
    "move:Eerie Impulse": 170,
    "move:Eerie Spell": 171,
    "move:Electric Terrain": 172,
    "move:Electro Ball": 173,
    "move:Electro Drift": 174,
    "move:Electro Shot": 175,
    "move:Electroweb": 176,
    "move:Ember": 177,
    "move:Encore": 178,
    "move:Endeavor": 179,
    "move:Endure": 180,
    "move:Energy Ball": 181,
    "move:Entrainment": 182,
    "move:Eruption": 183,
    "move:Esper Wing": 184,
    "move:Expanding Force": 185,
    "move:Explosion": 186,
    "move:Extrasensory": 187,
    "move:Extreme Speed": 188,
    "move:Facade": 189,
    "move:Fairy Lock": 190,
    "move:Fairy Wind": 191,
    "move:Fake Out": 192,
    "move:Fake Tears": 193,
    "move:False Surrender": 194,
    "move:False Swipe": 195,
    "move:Feather Dance": 196,
    "move:Feint": 197,
    "move:Fell Stinger": 198,
    "move:Fickle Beam": 199,
    "move:Fiery Dance": 200,
    "move:Fiery Wrath": 201,
    "move:Fillet Away": 202,
    "move:Final Gambit": 203,
    "move:Fire Blast": 204,
    "move:Fire Fang": 205,
    "move:Fire Lash": 206,
    "move:Fire Pledge": 207,
    "move:Fire Punch": 208,
    "move:Fire Spin": 209,
    "move:First Impression": 210,
    "move:Fissure": 211,
    "move:Flail": 212,
    "move:Flame Charge": 213,
    "move:Flame Wheel": 214,
    "move:Flamethrower": 215,
    "move:Flare Blitz": 216,
    "move:Flash Cannon": 217,
    "move:Flatter": 218,
    "move:Fling": 219,
    "move:Flip Turn": 220,
    "move:Floral Healing": 221,
    "move:Flower Trick": 222,
    "move:Fly": 223,
    "move:Flying Press": 224,
    "move:Focus Blast": 225,
    "move:Focus Energy": 226,
    "move:Focus Punch": 227,
    "move:Follow Me": 228,
    "move:Force Palm": 229,
    "move:Forest's Curse": 230,
    "move:Foul Play": 231,
    "move:Freeze Shock": 232,
    "move:Freeze-Dry": 233,
    "move:Freezing Glare": 234,
    "move:Frenzy Plant": 235,
    "move:Frost Breath": 236,
    "move:Fury Attack": 237,
    "move:Fury Cutter": 238,
    "move:Fury Swipes": 239,
    "move:Fusion Bolt": 240,
    "move:Fusion Flare": 241,
    "move:Future Sight": 242,
    "move:Gastro Acid": 243,
    "move:Gear Grind": 244,
    "move:Geomancy": 245,
    "move:Giga Drain": 246,
    "move:Giga Impact": 247,
    "move:Gigaton Hammer": 248,
    "move:Glacial Lance": 249,
    "move:Glaciate": 250,
    "move:Glaive Rush": 251,
    "move:Glare": 252,
    "move:Grass Knot": 253,
    "move:Grass Pledge": 254,
    "move:Grassy Glide": 255,
    "move:Grassy Terrain": 256,
    "move:Grav Apple": 257,
    "move:Gravity": 258,
    "move:Growl": 259,
    "move:Growth": 260,
    "move:Guard Split": 261,
    "move:Guard Swap": 262,
    "move:Guillotine": 263,
    "move:Gunk Shot": 264,
    "move:Gust": 265,
    "move:Gyro Ball": 266,
    "move:Hammer Arm": 267,
    "move:Hard Press": 268,
    "move:Harden": 269,
    "move:Haze": 270,
    "move:Head Smash": 271,
    "move:Headbutt": 272,
    "move:Headlong Rush": 273,
    "move:Heal Bell": 274,
    "move:Heal Pulse": 275,
    "move:Healing Wish": 276,
    "move:Heart Swap": 277,
    "move:Heat Crash": 278,
    "move:Heat Wave": 279,
    "move:Heavy Slam": 280,
    "move:Helping Hand": 281,
    "move:Hex": 282,
    "move:High Horsepower": 283,
    "move:High Jump Kick": 284,
    "move:Hold Back": 285,
    "move:Hone Claws": 286,
    "move:Horn Attack": 287,
    "move:Horn Drill": 288,
    "move:Horn Leech": 289,
    "move:Howl": 290,
    "move:Hurricane": 291,
    "move:Hydro Cannon": 292,
    "move:Hydro Pump": 293,
    "move:Hydro Steam": 294,
    "move:Hyper Beam": 295,
    "move:Hyper Drill": 296,
    "move:Hyper Voice": 297,
    "move:Hypnosis": 298,
    "move:Ice Beam": 299,
    "move:Ice Burn": 300,
    "move:Ice Fang": 301,
    "move:Ice Hammer": 302,
    "move:Ice Punch": 303,
    "move:Ice Shard": 304,
    "move:Ice Spinner": 305,
    "move:Icicle Crash": 306,
    "move:Icicle Spear": 307,
    "move:Icy Wind": 308,
    "move:Imprison": 309,
    "move:Incinerate": 310,
    "move:Infernal Parade": 311,
    "move:Inferno": 312,
    "move:Infestation": 313,
    "move:Ingrain": 314,
    "move:Instruct": 315,
    "move:Iron Defense": 316,
    "move:Iron Head": 317,
    "move:Iron Tail": 318,
    "move:Ivy Cudgel": 319,
    "move:Jaw Lock": 320,
    "move:Jet Punch": 321,
    "move:Judgment": 322,
    "move:Jungle Healing": 323,
    "move:King's Shield": 324,
    "move:Knock Off": 325,
    "move:Kowtow Cleave": 326,
    "move:Lash Out": 327,
    "move:Last Resort": 328,
    "move:Last Respects": 329,
    "move:Lava Plume": 330,
    "move:Leaf Blade": 331,
    "move:Leaf Storm": 332,
    "move:Leafage": 333,
    "move:Leech Life": 334,
    "move:Leech Seed": 335,
    "move:Leer": 336,
    "move:Lick": 337,
    "move:Life Dew": 338,
    "move:Light Screen": 339,
    "move:Liquidation": 340,
    "move:Lock-On": 341,
    "move:Lovely Kiss": 342,
    "move:Low Kick": 343,
    "move:Low Sweep": 344,
    "move:Lumina Crash": 345,
    "move:Lunar Blessing": 346,
    "move:Lunar Dance": 347,
    "move:Lunge": 348,
    "move:Luster Purge": 349,
    "move:Mach Punch": 350,
    "move:Magic Powder": 351,
    "move:Magic Room": 352,
    "move:Magical Leaf": 353,
    "move:Magma Storm": 354,
    "move:Magnet Rise": 355,
    "move:Magnetic Flux": 356,
    "move:Make It Rain": 357,
    "move:Malicious Moonsault": 358,
    "move:Malignant Chain": 359,
    "move:Matcha Gotcha": 360,
    "move:Mean Look": 361,
    "move:Mega Drain": 362,
    "move:Mega Kick": 363,
    "move:Mega Punch": 364,
    "move:Megahorn": 365,
    "move:Memento": 366,
    "move:Metal Burst": 367,
    "move:Metal Claw": 368,
    "move:Metal Sound": 369,
    "move:Meteor Beam": 370,
    "move:Meteor Mash": 371,
    "move:Metronome": 372,
    "move:Mighty Cleave": 373,
    "move:Milk Drink": 374,
    "move:Mimic": 375,
    "move:Minimize": 376,
    "move:Mirror Coat": 377,
    "move:Mist": 378,
    "move:Mist Ball": 379,
    "move:Misty Explosion": 380,
    "move:Misty Terrain": 381,
    "move:Moonblast": 382,
    "move:Moongeist Beam": 383,
    "move:Moonlight": 384,
    "move:Morning Sun": 385,
    "move:Mortal Spin": 386,
    "move:Mountain Gale": 387,
    "move:Mud Shot": 388,
    "move:Mud-Slap": 389,
    "move:Muddy Water": 390,
    "move:Multi-Attack": 391,
    "move:Mystical Fire": 392,
    "move:Mystical Power": 393,
    "move:Nasty Plot": 394,
    "move:Never-Ending Nightmare": 395,
    "move:Night Daze": 396,
    "move:Night Shade": 397,
    "move:Night Slash": 398,
    "move:No Retreat": 399,
    "move:Noble Roar": 400,
    "move:Nuzzle": 401,
    "move:Octolock": 402,
    "move:Order Up": 403,
    "move:Origin Pulse": 404,
    "move:Outrage": 405,
    "move:Overdrive": 406,
    "move:Overheat": 407,
    "move:Pain Split": 408,
    "move:Parabolic Charge": 409,
    "move:Parting Shot": 410,
    "move:Pay Day": 411,
    "move:Payback": 412,
    "move:Peck": 413,
    "move:Perish Song": 414,
    "move:Petal Blizzard": 415,
    "move:Petal Dance": 416,
    "move:Phantom Force": 417,
    "move:Photon Geyser": 418,
    "move:Pin Missile": 419,
    "move:Play Nice": 420,
    "move:Play Rough": 421,
    "move:Pluck": 422,
    "move:Poison Fang": 423,
    "move:Poison Gas": 424,
    "move:Poison Jab": 425,
    "move:Poison Powder": 426,
    "move:Poison Sting": 427,
    "move:Poison Tail": 428,
    "move:Pollen Puff": 429,
    "move:Poltergeist": 430,
    "move:Population Bomb": 431,
    "move:Pounce": 432,
    "move:Pound": 433,
    "move:Powder Snow": 434,
    "move:Power Gem": 435,
    "move:Power Split": 436,
    "move:Power Swap": 437,
    "move:Power Trick": 438,
    "move:Power Trip": 439,
    "move:Power Whip": 440,
    "move:Power-Up Punch": 441,
    "move:Precipice Blades": 442,
    "move:Present": 443,
    "move:Prismatic Laser": 444,
    "move:Protect": 445,
    "move:Psybeam": 446,
    "move:Psyblade": 447,
    "move:Psych Up": 448,
    "move:Psychic": 449,
    "move:Psychic Fangs": 450,
    "move:Psychic Noise": 451,
    "move:Psychic Terrain": 452,
    "move:Psycho Boost": 453,
    "move:Psycho Cut": 454,
    "move:Psyshield Bash": 455,
    "move:Psyshock": 456,
    "move:Psystrike": 457,
    "move:Pyro Ball": 458,
    "move:Quash": 459,
    "move:Quick Attack": 460,
    "move:Quick Guard": 461,
    "move:Quiver Dance": 462,
    "move:Rage Fist": 463,
    "move:Rage Powder": 464,
    "move:Raging Bull": 465,
    "move:Raging Fury": 466,
    "move:Rain Dance": 467,
    "move:Rapid Spin": 468,
    "move:Razor Leaf": 469,
    "move:Razor Shell": 470,
    "move:Recover": 471,
    "move:Recycle": 472,
    "move:Reflect": 473,
    "move:Reflect Type": 474,
    "move:Rest": 475,
    "move:Retaliate": 476,
    "move:Return": 477,
    "move:Revelation Dance": 478,
    "move:Reversal": 479,
    "move:Revival Blessing": 480,
    "move:Rising Voltage": 481,
    "move:Roar": 482,
    "move:Roar of Time": 483,
    "move:Rock Blast": 484,
    "move:Rock Polish": 485,
    "move:Rock Slide": 486,
    "move:Rock Smash": 487,
    "move:Rock Throw": 488,
    "move:Rock Tomb": 489,
    "move:Rock Wrecker": 490,
    "move:Role Play": 491,
    "move:Rollout": 492,
    "move:Roost": 493,
    "move:Round": 494,
    "move:Ruination": 495,
    "move:Sacred Fire": 496,
    "move:Sacred Sword": 497,
    "move:Safeguard": 498,
    "move:Salt Cure": 499,
    "move:Sand Attack": 500,
    "move:Sand Tomb": 501,
    "move:Sandsear Storm": 502,
    "move:Sandstorm": 503,
    "move:Scald": 504,
    "move:Scale Shot": 505,
    "move:Scary Face": 506,
    "move:Scorching Sands": 507,
    "move:Scratch": 508,
    "move:Screech": 509,
    "move:Secret Sword": 510,
    "move:Seed Bomb": 511,
    "move:Seed Flare": 512,
    "move:Seismic Toss": 513,
    "move:Self-Destruct": 514,
    "move:Shadow Ball": 515,
    "move:Shadow Claw": 516,
    "move:Shadow Force": 517,
    "move:Shadow Punch": 518,
    "move:Shadow Sneak": 519,
    "move:Shed Tail": 520,
    "move:Sheer Cold": 521,
    "move:Shell Side Arm": 522,
    "move:Shell Smash": 523,
    "move:Shelter": 524,
    "move:Shift Gear": 525,
    "move:Shock Wave": 526,
    "move:Shore Up": 527,
    "move:Silk Trap": 528,
    "move:Simple Beam": 529,
    "move:Sing": 530,
    "move:Sketch": 531,
    "move:Skill Swap": 532,
    "move:Skitter Smack": 533,
    "move:Sky Attack": 534,
    "move:Sky Drop": 535,
    "move:Slack Off": 536,
    "move:Slam": 537,
    "move:Slash": 538,
    "move:Sleep Powder": 539,
    "move:Sleep Talk": 540,
    "move:Sludge": 541,
    "move:Sludge Bomb": 542,
    "move:Sludge Wave": 543,
    "move:Smack Down": 544,
    "move:Smart Strike": 545,
    "move:Smog": 546,
    "move:Smokescreen": 547,
    "move:Snarl": 548,
    "move:Snatch": 549,
    "move:Snipe Shot": 550,
    "move:Snowscape": 551,
    "move:Soak": 552,
    "move:Soft-Boiled": 553,
    "move:Solar Beam": 554,
    "move:Solar Blade": 555,
    "move:Spacial Rend": 556,
    "move:Spark": 557,
    "move:Sparkling Aria": 558,
    "move:Speed Swap": 559,
    "move:Spicy Extract": 560,
    "move:Spikes": 561,
    "move:Spiky Shield": 562,
    "move:Spin Out": 563,
    "move:Spirit Break": 564,
    "move:Spirit Shackle": 565,
    "move:Spit Up": 566,
    "move:Spite": 567,
    "move:Splash": 568,
    "move:Spore": 569,
    "move:Springtide Storm": 570,
    "move:Stealth Rock": 571,
    "move:Steel Beam": 572,
    "move:Steel Roller": 573,
    "move:Steel Wing": 574,
    "move:Sticky Web": 575,
    "move:Stockpile": 576,
    "move:Stomp": 577,
    "move:Stomping Tantrum": 578,
    "move:Stone Axe": 579,
    "move:Stone Edge": 580,
    "move:Stored Power": 581,
    "move:Strange Steam": 582,
    "move:Strength": 583,
    "move:Strength Sap": 584,
    "move:String Shot": 585,
    "move:Struggle": 586,
    "move:Struggle Bug": 587,
    "move:Stuff Cheeks": 588,
    "move:Stun Spore": 589,
    "move:Substitute": 590,
    "move:Sucker Punch": 591,
    "move:Sunny Day": 592,
    "move:Sunsteel Strike": 593,
    "move:Super Fang": 594,
    "move:Supercell Slam": 595,
    "move:Superpower": 596,
    "move:Supersonic": 597,
    "move:Surf": 598,
    "move:Surging Strikes": 599,
    "move:Swagger": 600,
    "move:Swallow": 601,
    "move:Sweet Kiss": 602,
    "move:Sweet Scent": 603,
    "move:Swift": 604,
    "move:Switcheroo": 605,
    "move:Swords Dance": 606,
    "move:Synthesis": 607,
    "move:Syrup Bomb": 608,
    "move:Tachyon Cutter": 609,
    "move:Tackle": 610,
    "move:Tail Glow": 611,
    "move:Tail Slap": 612,
    "move:Tail Whip": 613,
    "move:Tailwind": 614,
    "move:Take Down": 615,
    "move:Take Heart": 616,
    "move:Tar Shot": 617,
    "move:Taunt": 618,
    "move:Tearful Look": 619,
    "move:Teatime": 620,
    "move:Teeter Dance": 621,
    "move:Teleport": 622,
    "move:Temper Flare": 623,
    "move:Tera Blast": 624,
    "move:Tera Starstorm": 625,
    "move:Terrain Pulse": 626,
    "move:Thief": 627,
    "move:Thousand Arrows": 628,
    "move:Thrash": 629,
    "move:Throat Chop": 630,
    "move:Thunder": 631,
    "move:Thunder Cage": 632,
    "move:Thunder Fang": 633,
    "move:Thunder Punch": 634,
    "move:Thunder Shock": 635,
    "move:Thunder Wave": 636,
    "move:Thunderbolt": 637,
    "move:Thunderclap": 638,
    "move:Thunderous Kick": 639,
    "move:Tickle": 640,
    "move:Tidy Up": 641,
    "move:Topsy-Turvy": 642,
    "move:Torch Song": 643,
    "move:Torment": 644,
    "move:Toxic": 645,
    "move:Toxic Spikes": 646,
    "move:Toxic Thread": 647,
    "move:Trailblaze": 648,
    "move:Transform": 649,
    "move:Tri Attack": 650,
    "move:Trick": 651,
    "move:Trick Room": 652,
    "move:Triple Arrows": 653,
    "move:Triple Axel": 654,
    "move:Triple Dive": 655,
    "move:Triple Kick": 656,
    "move:Trop Kick": 657,
    "move:Twin Beam": 658,
    "move:Twister": 659,
    "move:U-turn": 660,
    "move:Upper Hand": 661,
    "move:Uproar": 662,
    "move:Vacuum Wave": 663,
    "move:Venoshock": 664,
    "move:Victory Dance": 665,
    "move:Vine Whip": 666,
    "move:Volt Switch": 667,
    "move:Volt Tackle": 668,
    "move:Wake-Up Slap": 669,
    "move:Water Gun": 670,
    "move:Water Pledge": 671,
    "move:Water Pulse": 672,
    "move:Water Shuriken": 673,
    "move:Water Spout": 674,
    "move:Waterfall": 675,
    "move:Wave Crash": 676,
    "move:Weather Ball": 677,
    "move:Whirlpool": 678,
    "move:Whirlwind": 679,
    "move:Wicked Blow": 680,
    "move:Wide Guard": 681,
    "move:Wild Charge": 682,
    "move:Wildbolt Storm": 683,
    "move:Will-O-Wisp": 684,
    "move:Wing Attack": 685,
    "move:Wish": 686,
    "move:Withdraw": 687,
    "move:Wonder Room": 688,
    "move:Wood Hammer": 689,
    "move:Work Up": 690,
    "move:Worry Seed": 691,
    "move:Wrap": 692,
    "move:X-Scissor": 693,
    "move:Yawn": 694,
    "move:Z-Trick-or-Treat": 695,
    "move:Zap Cannon": 696,
    "move:Zen Headbutt": 697,
    "move:Zing Zap": 698,
    "switch:Abomasnow": 699,
    "switch:Aegislash": 700,
    "switch:Aggron": 701,
    "switch:Aipom": 702,
    "switch:Alakazam-Mega": 703,
    "switch:Alcremie": 704,
    "switch:Alcremie-Caramel-Swirl": 705,
    "switch:Alcremie-Lemon-Cream": 706,
    "switch:Alcremie-Matcha-Cream": 707,
    "switch:Alcremie-Mint-Cream": 708,
    "switch:Alcremie-Rainbow-Swirl": 709,
    "switch:Alcremie-Ruby-Cream": 710,
    "switch:Alcremie-Ruby-Swirl": 711,
    "switch:Alcremie-Salted-Cream": 712,
    "switch:Alomomola": 713,
    "switch:Altaria": 714,
    "switch:Ambipom": 715,
    "switch:Amoonguss": 716,
    "switch:Ampharos": 717,
    "switch:Annihilape": 718,
    "switch:Appletun": 719,
    "switch:Applin": 720,
    "switch:Araquanid": 721,
    "switch:Arbok": 722,
    "switch:Arboliva": 723,
    "switch:Arcanine": 724,
    "switch:Arcanine-Hisui": 725,
    "switch:Arceus-Fairy": 726,
    "switch:Arceus-Water": 727,
    "switch:Archaludon": 728,
    "switch:Archeops": 729,
    "switch:Arctibax": 730,
    "switch:Arctozolt": 731,
    "switch:Ariados": 732,
    "switch:Armaldo": 733,
    "switch:Armarouge": 734,
    "switch:Articuno": 735,
    "switch:Articuno-Galar": 736,
    "switch:Audino": 737,
    "switch:Avalugg": 738,
    "switch:Avalugg-Hisui": 739,
    "switch:Axew": 740,
    "switch:Azelf": 741,
    "switch:Azumarill": 742,
    "switch:Azurill": 743,
    "switch:Bagon": 744,
    "switch:Banette": 745,
    "switch:Barboach": 746,
    "switch:Barraskewda": 747,
    "switch:Basculegion": 748,
    "switch:Basculegion-F": 749,
    "switch:Basculin": 750,
    "switch:Basculin-Blue-Striped": 751,
    "switch:Basculin-White-Striped": 752,
    "switch:Bastiodon": 753,
    "switch:Baxcalibur": 754,
    "switch:Bayleef": 755,
    "switch:Beartic": 756,
    "switch:Beedrill": 757,
    "switch:Beedrill-Mega": 758,
    "switch:Bellibolt": 759,
    "switch:Bellossom": 760,
    "switch:Bergmite": 761,
    "switch:Bibarel": 762,
    "switch:Bisharp": 763,
    "switch:Blastoise": 764,
    "switch:Blastoise-Mega": 765,
    "switch:Blaziken": 766,
    "switch:Blissey": 767,
    "switch:Blitzle": 768,
    "switch:Bombirdier": 769,
    "switch:Bonsly": 770,
    "switch:Braixen": 771,
    "switch:Brambleghast": 772,
    "switch:Braviary": 773,
    "switch:Braviary-Hisui": 774,
    "switch:Breloom": 775,
    "switch:Brionne": 776,
    "switch:Bronzong": 777,
    "switch:Bronzor": 778,
    "switch:Brute Bonnet": 779,
    "switch:Bruxish": 780,
    "switch:Buizel": 781,
    "switch:Bulbasaur": 782,
    "switch:Cacnea": 783,
    "switch:Cacturne": 784,
    "switch:Calyrex": 785,
    "switch:Calyrex-Ice": 786,
    "switch:Calyrex-Shadow": 787,
    "switch:Camerupt": 788,
    "switch:Carbink": 789,
    "switch:Carkol": 790,
    "switch:Carnivine": 791,
    "switch:Castform": 792,
    "switch:Celebi": 793,
    "switch:Centiskorch": 794,
    "switch:Ceruledge": 795,
    "switch:Cetitan": 796,
    "switch:Cetoddle": 797,
    "switch:Chandelure": 798,
    "switch:Chansey": 799,
    "switch:Charizard": 800,
    "switch:Charjabug": 801,
    "switch:Charmander": 802,
    "switch:Charmeleon": 803,
    "switch:Cherrim": 804,
    "switch:Chesnaught": 805,
    "switch:Chespin": 806,
    "switch:Chi-Yu": 807,
    "switch:Chien-Pao": 808,
    "switch:Chikorita": 809,
    "switch:Chimecho": 810,
    "switch:Chinchou": 811,
    "switch:Chingling": 812,
    "switch:Cinccino": 813,
    "switch:Cinderace": 814,
    "switch:Clauncher": 815,
    "switch:Clawitzer": 816,
    "switch:Claydol": 817,
    "switch:Clefable": 818,
    "switch:Clefairy": 819,
    "switch:Cleffa": 820,
    "switch:Clodsire": 821,
    "switch:Cloyster": 822,
    "switch:Coalossal": 823,
    "switch:Cobalion": 824,
    "switch:Cofagrigus": 825,
    "switch:Combee": 826,
    "switch:Combusken": 827,
    "switch:Comfey": 828,
    "switch:Conkeldurr": 829,
    "switch:Copperajah": 830,
    "switch:Corphish": 831,
    "switch:Corviknight": 832,
    "switch:Corvisquire": 833,
    "switch:Cosmoem": 834,
    "switch:Cosmog": 835,
    "switch:Cottonee": 836,
    "switch:Crabominable": 837,
    "switch:Crabrawler": 838,
    "switch:Cramorant": 839,
    "switch:Cranidos": 840,
    "switch:Crawdaunt": 841,
    "switch:Cresselia": 842,
    "switch:Croagunk": 843,
    "switch:Crocalor": 844,
    "switch:Croconaw": 845,
    "switch:Cryogonal": 846,
    "switch:Cubchoo": 847,
    "switch:Cufant": 848,
    "switch:Cutiefly": 849,
    "switch:Cyclizar": 850,
    "switch:Cyndaquil": 851,
    "switch:Dachsbun": 852,
    "switch:Dartrix": 853,
    "switch:Decidueye": 854,
    "switch:Decidueye-Hisui": 855,
    "switch:Dedenne": 856,
    "switch:Delibird": 857,
    "switch:Delphox": 858,
    "switch:Deoxys-Attack": 859,
    "switch:Dewgong": 860,
    "switch:Dewpider": 861,
    "switch:Dialga": 862,
    "switch:Dialga-Origin": 863,
    "switch:Diancie": 864,
    "switch:Diglett": 865,
    "switch:Diglett-Alola": 866,
    "switch:Dipplin": 867,
    "switch:Ditto": 868,
    "switch:Dodrio": 869,
    "switch:Doduo": 870,
    "switch:Dolliv": 871,
    "switch:Dondozo": 872,
    "switch:Donphan": 873,
    "switch:Dracozolt": 874,
    "switch:Dragalge": 875,
    "switch:Dragapult": 876,
    "switch:Dragonair": 877,
    "switch:Dragonite": 878,
    "switch:Drakloak": 879,
    "switch:Dratini": 880,
    "switch:Drednaw": 881,
    "switch:Dreepy": 882,
    "switch:Drifblim": 883,
    "switch:Drifloon": 884,
    "switch:Drilbur": 885,
    "switch:Drizzile": 886,
    "switch:Drowzee": 887,
    "switch:Dudunsparce": 888,
    "switch:Dudunsparce-Three-Segment": 889,
    "switch:Dugtrio": 890,
    "switch:Dugtrio-Alola": 891,
    "switch:Dunsparce": 892,
    "switch:Duosion": 893,
    "switch:Duraludon": 894,
    "switch:Dusclops": 895,
    "switch:Dusknoir": 896,
    "switch:Duskull": 897,
    "switch:Eelektrik": 898,
    "switch:Eelektross": 899,
    "switch:Eevee": 900,
    "switch:Eiscue": 901,
    "switch:Eiscue-Noice": 902,
    "switch:Electabuzz": 903,
    "switch:Electivire": 904,
    "switch:Electrode": 905,
    "switch:Electrode-Hisui": 906,
    "switch:Elekid": 907,
    "switch:Emboar": 908,
    "switch:Emolga": 909,
    "switch:Empoleon": 910,
    "switch:Enamorus": 911,
    "switch:Enamorus-Therian": 912,
    "switch:Entei": 913,
    "switch:Escavalier": 914,
    "switch:Espathra": 915,
    "switch:Espeon": 916,
    "switch:Espurr": 917,
    "switch:Eternatus": 918,
    "switch:Excadrill": 919,
    "switch:Exeggcute": 920,
    "switch:Exeggutor": 921,
    "switch:Exeggutor-Alola": 922,
    "switch:Falinks": 923,
    "switch:Farigiraf": 924,
    "switch:Feebas": 925,
    "switch:Feraligatr": 926,
    "switch:Fezandipiti": 927,
    "switch:Fidough": 928,
    "switch:Finneon": 929,
    "switch:Flaaffy": 930,
    "switch:Flamigo": 931,
    "switch:Flapple": 932,
    "switch:Flareon": 933,
    "switch:Fletchinder": 934,
    "switch:Fletchling": 935,
    "switch:Floatzel": 936,
    "switch:Floette-White": 937,
    "switch:Floragato": 938,
    "switch:Florges": 939,
    "switch:Florges-Blue": 940,
    "switch:Florges-Orange": 941,
    "switch:Florges-White": 942,
    "switch:Florges-Yellow": 943,
    "switch:Flutter Mane": 944,
    "switch:Flygon": 945,
    "switch:Foongus": 946,
    "switch:Forretress": 947,
    "switch:Fraxure": 948,
    "switch:Froakie": 949,
    "switch:Frogadier": 950,
    "switch:Froslass": 951,
    "switch:Frosmoth": 952,
    "switch:Furret": 953,
    "switch:Gabite": 954,
    "switch:Gallade": 955,
    "switch:Galvantula": 956,
    "switch:Garchomp": 957,
    "switch:Gardevoir": 958,
    "switch:Garganacl": 959,
    "switch:Gastly": 960,
    "switch:Gastrodon": 961,
    "switch:Gastrodon-East": 962,
    "switch:Gengar": 963,
    "switch:Gengar-Mega": 964,
    "switch:Geodude": 965,
    "switch:Geodude-Alola": 966,
    "switch:Gholdengo": 967,
    "switch:Gigalith": 968,
    "switch:Gimmighoul": 969,
    "switch:Gimmighoul-Roaming": 970,
    "switch:Girafarig": 971,
    "switch:Giratina": 972,
    "switch:Giratina-Origin": 973,
    "switch:Glaceon": 974,
    "switch:Glalie": 975,
    "switch:Glastrier": 976,
    "switch:Gligar": 977,
    "switch:Glimmet": 978,
    "switch:Glimmora": 979,
    "switch:Gliscor": 980,
    "switch:Gloom": 981,
    "switch:Gogoat": 982,
    "switch:Golduck": 983,
    "switch:Golem": 984,
    "switch:Golem-Alola": 985,
    "switch:Golett": 986,
    "switch:Golurk": 987,
    "switch:Goodra": 988,
    "switch:Goodra-Hisui": 989,
    "switch:Goomy": 990,
    "switch:Gorebyss": 991,
    "switch:Gothita": 992,
    "switch:Gothitelle": 993,
    "switch:Gothorita": 994,
    "switch:Gouging Fire": 995,
    "switch:Grafaiai": 996,
    "switch:Granbull": 997,
    "switch:Grapploct": 998,
    "switch:Graveler": 999,
    "switch:Graveler-Alola": 1000,
    "switch:Great Tusk": 1001,
    "switch:Greavard": 1002,
